{"data":[{"code":"ART2411061017X5LOFA","origin_url":"https://www.bangkokpost.com/thailand/pr/2897303/alive-by-aia-launches-be-the-best-version-campaign","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241106/c1_2897303_700.jpg","title":"ALive by AIA Launches ‘Be the Best Version’ Campaign","description":"ALive Powered by AIA, the one-stop health and wellness application, has launched the “Be the Best Version of Yourself with ALive” campaign. This initiative aims to inspire individuals at every stage of life, bringing smiles and joy through activities that empower them to become better versions of themselves each day.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060806S2QNKN","origin_url":"https://www.bangkokpost.com/thailand/pr/2897241/affordability-project-revolutionizing-diabetes-care-and-creating-equal-access","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/f316cf9d-5800-4714-b2a4-b176bc20fc07","title":"Affordability Project: Revolutionizing Diabetes Care and Creating Equal Access","description":"The global diabetes crisis is worsening. With over 537 million people currently living with diabetes worldwide, the International Diabetes Federation (IDF) predicts this number to soar to 643 million by 2030. Diabetes is a leading cause of death, claiming 6.7 million lives each year, or one death every 5 seconds. Thailand is no exception, with an estimated 5.3 million people expected to be living with diabetes by 2040. Alarmingly, nearly half of these cases remain undiagnosed. Diabetes not only poses serious health risks, including heart disease and kidney disease, but also imposes a significant economic burden, costing the country 47.596 billion baht annually.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060716AAKQP8","origin_url":"https://www.bangkokpost.com/thailand/pr/2897232/vnpays-drive-for-a-cashless-future-in-vietnam-shifting-from-cash-to-click","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/0d1c38b8-c354-4418-bc78-26ed1a3a6979","title":"VNPAY’s Drive for a Cashless Future in Vietnam: Shifting from Cash to Click","description":"VNPAY Digital Wallet, one of Vietnam","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060637ZLJ55T","origin_url":"https://www.bangkokpost.com/thailand/pr/2897213/mdes-backs-thailands-international-digital-business-centre","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241106/c1_2897213_700.jpg","title":"MDES Backs Thailand’s International Digital Business Centre","description":"The Ministry of Digital Economy and Society (MDES) is supporting the Thailand International Digital Business & Finance Centre (TIDC) project, a key collaboration to foster a digital-first ecosystem, attract investment in digital businesses, and drive the development of digital innovations within Thailand. The National Telecom Public Company Limited (NT) will also contribute to the TIDC project by participating as a leader in advancing digital business concepts.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060637VWFLDB","origin_url":"https://www.bangkokpost.com/thailand/pr/2897123/shaping-the-future-stem-education-for-world-class-universities","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/b6163cc1-221f-43cc-abcd-a32c16383126","title":"Shaping the Future: STEM Education for World-Class Universities","description":"In today","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060637DUA1HC","origin_url":"https://www.bangkokpost.com/thailand/pr/2897223/siam-motors-and-highgate-school-to-launch-thai-campus","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ac4fb4c6-70b7-4198-b43e-e6eaf3d70a60","title":"Siam Motors and Highgate School to Launch Thai Campus","description":"Siam Motors Group (SMG) and the Phornprapha family are delighted to announce their partnership with Highgate School UK to establish their first international school in Thailand. Highgate International School Thailand will welcome its first students in August 2026, set in the beautiful surroundings near Siam Country Club, Chonburi. The school will offer a first-rate academic yet holistic education for students aged 2 to 18, starting with Pre-Prep and Junior School (ages 2 to 11), with plans to expand to Senior School and boarding facilities, ultimately accommodating up to 1,400 students. With world-class facilities, students will follow the English National Curriculum, culminating in IGCSE and A Levels.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110606371BU93G","origin_url":"https://www.bangkokpost.com/thailand/pr/2896503/proud-earns-fitwel-certification-raising-thailands-wellness-standard","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896503_700.png","title":"PROUD Earns Fitwel Certification, Raising Thailand's Wellness Standard","description":"PROUD Real Estate Public Company Limited continues to lead Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060506C6VQ8W","origin_url":"https://www.bangkokpost.com/thailand/pr/2897137/myanmar-corn-industry-embraces-traceability-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/929e131a-fcff-439a-bfcd-56f0db542a06","title":"Myanmar Corn Industry Embraces Traceability for Sustainable Growth","description":"The Myanmar Corn Industrial Association (MCIA) is committed to advancing sustainability and transparency in the corn industry through the adoption of CP Group’s new traceability system. This initiative, championed by MCIA Chairman U Aye Chan Aung, strengthens a key collaboration between public and private sectors, aiming to engage every farmer and operator across the industry.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241106043667QW1K","origin_url":"https://www.bangkokpost.com/thailand/pr/2897121/anantara-siam-welcomes-michelin-star-chef-residency-at-biscotti","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/960edc0d-361d-42c2-8de7-9e6960bffb5f","title":"Anantara Siam Welcomes Michelin-Star Chef Residency at Biscotti","description":"This season, Anantara Siam Bangkok Hotel’s renowned Italian restaurant, Biscotti, unveils an exclusive chef residency, welcoming Italy’s celebrated Cristina Bowerman from the Michelin-starred Glass Hostaria in Rome. From 6th November to 30th December 2024, Bangkok diners will have the rare chance to experience Chef Bowerman’s contemporary Italian cuisine, redefining traditional fare with a creative twist that reflects her passion for cultural heritage, memory, and innovation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411060322EMQ7VD","origin_url":"https://www.bangkokpost.com/thailand/pr/2897058/phothalai-debuts-track-man-4-with-southeast-asias-first-virtual-golf-tournament","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/c39a05a6-bcd4-4bca-aaba-a3ef5c2ce819","title":"Phothalai Debuts Track Man 4 with Southeast Asia’s First Virtual Golf Tournament","description":"Phothalai Leisure Park Co., Ltd., led by CEO and Founder Mr. Anan Tavisaengsiri, has introduced the state-of-the-art Track Man 4 system at Phothalai Golf Driving Range, enhancing the range to an 18-hole course standard. This launch coincides with the \"Phothalai – Singha Thailand PGA Virtual Golf Tournament 2024,\" Southeast Asia’s first virtual golf tournament, supported by the Professional Golf Association of Thailand and Boon Rawd Brewery Co., Ltd.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241105114748WSOZ","origin_url":"https://www.bangkokpost.com/thailand/pr/2896483/kbtg-partners-with-leading-universities-to-launch-masters-programmes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/96baf1f4-8f4c-470e-afe6-9fd087f53f5e","title":"KBTG Partners with Leading Universities to Launch Master’s Programmes","description":"KBTG, in partnership with King Mongkut’s Institute of Technology Ladkrabang (KMITL), Mahidol University (MU), and Thammasat University (TU), has introduced a graduate-level initiative through KBTG Kampus. This programme aims to deepen Thailand’s tech education by fostering practical research and studies addressing real-world industry challenges. Through this collaboration, KBTG strengthens its role as a leader in Thailand’s rapidly advancing tech landscape.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411051007C6X4YK","origin_url":"https://www.bangkokpost.com/thailand/pr/2896328/global-exhibition-leaders-affirm-thailands-potential-as-top-destination","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896328_700.jpg","title":"Global Exhibition Leaders Affirm Thailand’s Potential as Top Destination","description":"The Exhibition Industry Summit 2024, Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050932QPY6F9","origin_url":"https://www.bangkokpost.com/thailand/pr/2896426/eva-air-launches-24-7-bilingual-global-customer-support","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896426_700.jpg","title":"EVA Air Launches 24/7 Bilingual Global Customer Support","description":"EVA Air has officially launched its 24/7 global customer service, offering around-the-clock support exclusively in Chinese and English, making it the first airline in Taiwan to provide this level of service. Passengers around the world can now call their local EVA Air customer service line anytime for assistance in Chinese or English, while support in other local languages remains available during regular service hours. For more information on EVA Air’s global service network, please visit   www.evaair.com  .","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050732OHDMRJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2896373/pepsico-giz-project-builds-climate-resilience-in-thai-agriculture","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896373_700.jpg","title":"PepsiCo-GIZ Project Builds Climate Resilience in Thai Agriculture","description":"Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH, PepsiCo Services Asia Limited and Pepsi Cola (Thai) Trading as well as governmental partners and local communities announced their joint achievement in implementing the Building a Climate Resilient Potato Supply Chain Through a Whole-Farm Approach (RePSC) project, leading to a strengthened public private partnership and livelihoods and capacity development among thousands of farmers particularly the female groups in Chiang Mai and Chiang Rai.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050706T60NJN","origin_url":"https://www.bangkokpost.com/thailand/pr/2896383/irpc-and-ptt-support-khung-bang-kachao-with-hdpe-pipes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/3b68a301-f861-4be2-8eb7-73b1cb724431","title":"IRPC and PTT Support Khung Bang Kachao with HDPE Pipes","description":"IRPC Public Co., Ltd. (IRPC), led by Chanida Sanhakorn, Senior Manager of Corporate Branding & Communication, and Komkrit Phewthong, Manager of PTT Reforestation, received a 100-metre HDPE pipeline from Nattabhumi Laosathirawong, Plant Manager of Thai-Asia P.E. Pipe Co., Ltd., a leading Thai manufacturer of advanced HDPE piping systems.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050637PR9KVD","origin_url":"https://www.bangkokpost.com/thailand/pr/2896382/pwa-first-elevating-water-services-and-organisational-excellence","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/7b1c9f85-d103-4262-982d-5f2897bffc62","title":"PWA First: Elevating Water Services and Organisational Excellence","description":"The Provincial Waterworks Authority (PWA) has unveiled its 2025 policy and operational roadmap, \"PWA First,\" aimed at driving organisational excellence across all facets of water utility services while aligning with national and Ministry of Interior directives. The announcement was made on November 4, 2025, at PWA Headquarters in the Prapawiwat Building.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050451PIC6QF","origin_url":"https://www.bangkokpost.com/thailand/pr/2896337/thaioil-wins-set-award-for-sustainability-excellence-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/4c384e28-bf20-40b9-a4e5-5e3970860443","title":"Thaioil Wins SET Award for Sustainability Excellence 2024","description":"Thai Oil Public Company Limited (Thaioil), represented by Miss Korapat Limpaphayom, Vice President – Group Company Secretary and Sustainability, recently received the Sustainability Excellence Award in the Commended Sustainability subcategory at the SET Awards 2024. The award was presented by Professor Emeritus Kittipong Urapipatanapong, Chairman of the Board of Directors of the Stock Exchange of Thailand (SET), during the SET Awards 2024 ceremony, jointly organised by the Stock Exchange of Thailand and Money & Banking Magazine at the Professor Sangvien Indaravijaya Auditorium on the 7th floor of the SET building.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050131M34805","origin_url":"https://www.bangkokpost.com/thailand/pr/2895797/ericsson-shaping-the-future-of-connectivity-in-thailand","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/544cf56c-03db-48f1-86d3-1b3f74d2c76f","title":"Ericsson: Shaping the Future of Connectivity in Thailand","description":"As Thailand stands at the cusp of a digital revolution, the potential of 5G technology to reshape industries, bolster the economy, and elevate society as a whole has never been more evident. With a rich 118-year legacy in the country, Ericsson Thailand is proud to be leading this wave of transformation with 5G. Based on its world-class expertise in 5G, Ericsson is playing a pivotal role in driving digitalisation and empowering Thailand to unlock the full potential of its digital economy. It is supporting Thailand’s journey to become a digital economy and emerge as a leading digital hub in Southeast Asia.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041051CE3GHV","origin_url":"https://www.bangkokpost.com/thailand/pr/2895807/bitkub-summit-2024-showcases-investment-and-tech-for-a-sustainable-future","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/82d032ae-b58d-4db1-a8ef-e92809398731","title":"BITKUB SUMMIT 2024 Showcases Investment and Tech for a Sustainable Future","description":"Bitkub Capital Group Holdings Co., Ltd., Thailand’s leader in blockchain technology and digital assets, organised the national seminar BITKUB SUMMIT 2024 under the theme Gateway to the Future: Opening the Door to Technology and Investment for a Sustainable Future. The event shared insights on investment, technology, and entrepreneurship from over 60 leading national speakers, including politicians, business leaders, investors, and public figures. Held from 19–20 October 2024 at the Plenary Hall, Queen Sirikit National Convention Center in Bangkok, it featured 20 stages and numerous activities, with a total value exceeding 3 million baht.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041022G4ZZO2","origin_url":"https://www.bangkokpost.com/thailand/pr/2895786/loréal-celebrates-115-years-by-honouring-thai-women-scientists","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/13298eb2-f4ec-4219-b65f-86c5b9597fdb","title":"L'Oréal Celebrates 115 Years by Honouring Thai Women Scientists","description":"From left to right: Asst. Prof. Dr. Waleeporn Donphai from the Department of Chemical Engineering, Faculty of Engineering, Kasetsart University, who received the grant in the field of Physical Sciences; Assoc. Prof. Dr. Anyanee Kamkaew from the School of Science, Suranaree University of Technology, awarded in the field of Life Sciences; and Dr. Pongkarn Chakthranont from the National Nanotechnology Center, National Science and Technology Development Agency (NSTDA), awarded in the field of Physical Sciences.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041007XEQC5B","origin_url":"https://www.bangkokpost.com/thailand/pr/2895611/dbs-secures-the-best-kindergarten-title-at-theasianparent-awards-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/74d13dca-85a8-4fb0-aec5-68fc331fe673","title":"DBS Secures The Best Kindergarten Title at theAsianparent Awards 2024","description":"In a landmark achievement,   DBS Denla British School   has been crowned   Parents’ Choice Best Kindergarten   at the prestigious   theAsianparent Awards 2024  . This recognition, presented at a grand ceremony held on October 29th, 2024, at Synergy Hall, Energy Complex, Bangkok, underscores DBS’s reputation as the leading choice for early childhood education in Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSZDDP72.json"}