{"data":[{"code":"ART2411220931HY00QL","origin_url":"https://www.bangkokpost.com/thailand/pr/2906935/toa-unveils-2025-color-trends-with-seamless-synchrony-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906935_700.jpg","title":"TOA Unveils 2025 Color Trends with Seamless Synchrony ","description":"TOA Paint (Thailand) Public Company Limited (TOA) has unveiled its 2025 Color Trends, introducing two new color groups under the concept of “Seamless Synchrony.” These trends are designed to connect people, living spaces, and the environment sustainably, affirming TOA’s status as Thailand’s leading provider of eco-friendly construction materials and comprehensive color solutions.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411220931AHE55F","origin_url":"https://www.bangkokpost.com/thailand/pr/2906951/siam-paragon-celebrates-19th-anniversary-with-magical-festivities-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906951_700.jpg","title":"Siam Paragon Celebrates 19th Anniversary with Magical Festivities ","description":"Siam Paragon marks its significant 19th anniversary with  “Siam Paragon 19th Anniversary: The Magical Celebration,”  reaffirming its status as a global and luxury destination for both Thai and international visitors. Running from 2-10 December 2024, this grand celebration invites all to enjoy an array of exciting events, exclusive promotions, and commemorative gifts.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112208328X7DIJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2906915/nt-welcomes-global-telecommunications-partners-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906915_700.jpg","title":"NT Welcomes Global Telecommunications Partners ","description":"National Telecom Public Company Limited (NT), led by Apichart Swankhamthorn, Senior Executive Vice President for Product Market Group, welcomed international telecommunications partners attending the Telecoms World Asia 2024 conference.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241122074732OZA6","origin_url":"https://www.bangkokpost.com/thailand/pr/2906905/sbs-international-bangkok-opens-near-suvarnabhumi-airport","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906905_700.jpg","title":"SBS International Bangkok Opens Near Suvarnabhumi Airport","description":"The Arthit Ourairat Institution (AOI) proudly announces the opening of its fourth campus, SBS International Bangkok, located in Lat Krabang, conveniently close to Suvarnabhumi Airport. Under the experienced leadership of Neil Crossland, former Deputy Head of School at the British International School Phuket (BISP), SBS International Bangkok offers a comprehensive British international curriculum from kindergarten through to Year 13.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112207162PNLK3","origin_url":"https://www.bangkokpost.com/thailand/pr/2906887/thaioil-unveils-2025-strategy-prioritises-clean-fuel-project-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906887_700.jpg","title":"Thaioil Unveils 2025 Strategy, Prioritises Clean Fuel Project ","description":"Thai Oil Public Company Limited (Thaioil) has revealed its 2025 business strategy, focusing on sustainable growth despite anticipated challenges in both domestic and international energy and petrochemical markets. Thaioil remains confident in its long-term growth potential and opportunities, particularly through the expedited management of the Clean Fuel Project (CFP), which will serve as a crucial foundation for strengthening the company and ensuring national energy security.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411220452NEZK90","origin_url":"https://www.bangkokpost.com/thailand/pr/2906826/redefining-rhinoplasty-dr-weerakarn-satitniramai-artistic-expertise-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/9c184e20-ca80-4e71-8a47-c525cece382b","title":"Redefining Rhinoplasty: Dr. Weerakarn Satitniramai Artistic Expertise  ","description":"EMMA Clinic introduces the unique approach of Dr. Weerakarn Satitniramai, a rising star in plastic surgery known for his expertise in open rhinoplasty using rib cartilage. His innovative techniques aim to enhance beauty for individuals of all generations.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411220421SGAE80","origin_url":"https://www.bangkokpost.com/thailand/pr/2906815/bangchak-triumphs-with-seven-awards-at-tma-2024-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/5cafeaad-c760-47f9-824f-58999cf18780","title":"Bangchak triumphs with seven awards at TMA 2024 ","description":"Bangchak Corporation Public Company Limited secured seven prestigious accolades at the 22nd Thailand Corporate Excellence Awards 2024, including two Royal Awards for Product/Service Excellence and Corporate Improvement Excellence. The awards ceremony, presided over by Privy Councillor Chirayu Isarangkun Na Ayuthaya, was held at The Athenee Hotel, a Luxury Collection Hotel, Bangkok.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411220302K9TTNZ","origin_url":"https://www.bangkokpost.com/thailand/pr/2906790/southeast-asias-first-nintendo-authorised-store-opens-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2906790_700.jpg","title":"Southeast Asia’s First Nintendo Authorised Store Opens ","description":"SYNNEX (Thailand) Public Company Limited, Thailand’s leading importer and distributor of IT products and services, has partnered with COPPERWIRED Public Company Limited and Siam Paragon to launch Southeast Asia’s first Nintendo Authorised Store by SYNNEX. Situated in the heart of Bangkok, this flagship store promises to offer an immersive gaming experience through strategic collaboration among key industry leaders. The synergy between these partners is set to enhance competitiveness, meeting the growing demand in the gaming market while addressing evolving consumer needs.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411220007VJQKCB","origin_url":"https://www.bangkokpost.com/thailand/pr/2906255/smbc-celebrates-partnerships-at-ceo-client-evening-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ac851f02-8a55-4695-8e3a-a912e32d6ffa","title":"SMBC Celebrates Partnerships at CEO Client Evening ","description":"Sumitomo Mitsui Banking Corporation (SMBC) reaffirmed its commitment to fostering strong relationships and supporting economic growth in Thailand with its   SMBC CEO Client Appreciation Evening . Held at The Athenee Hotel in the heart of Bangkok on Monday, November 18, 2024, this prestigious event brought together a distinguished audience of clients, industry leaders, and government officials to celebrate shared successes and explore future growth opportunities in Thailand and the broader ASEAN region.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411211122O9MFIF","origin_url":"https://www.bangkokpost.com/thailand/pr/2906282/bridgestone-unveils-new-second-generation-lunar-rover-tire-innovation","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/09004b1c-3f67-4b8e-a9ea-327471923e47","title":"Bridgestone Unveils  New Second-Generation Lunar Rover Tire Innovation","description":"Bridgestone Corporation has made a significant leap in innovation with the development of its new lunar rover tire, designed to withstand the extreme conditions of the moon","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411211006ZT9CZR","origin_url":"https://www.bangkokpost.com/thailand/pr/2906265/taiwan-expo-brings-smart-innovation-to-thailand-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241121/c1_2906265_700.jpg","title":"Taiwan Expo Brings Smart Innovation to Thailand ","description":"TAIWAN EXPO 2024 in Thailand, organised by the International Trade Administration, Ministry of Economic Affairs (TITA) and implemented by the Taiwan External Trade Development Council (TAITRA), officially opened in Bangkok on 21 November 2024. Centred around the theme \"Advancing Smart New Southbound,\" the expo features 170 Taiwanese companies across 10 pavilions and six major exhibit areas. These exhibits highlight innovations in Smart Manufacturing, Smart Medical, Smart Lifestyle, Circular Economy, and Culture & Tourism.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112109224AJ21W","origin_url":"https://www.bangkokpost.com/thailand/pr/2905705/thailand-debut-jy-air-redefines-smart-electric-travel-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241121/c1_2905705_241121112420_700.jpg","title":"Thailand Debut: JY AIR Redefines Smart Electric Travel ","description":"Juneyao  Auto (Thailand) Co., Ltd., a manufacturer and distributor of electric vehicles under Juneyao Group, the parent company of Juneyao Airlines, one of the leading private airlines in China, officially launched its intelligent electric vehicle brand. The launch features the first electric vehicle model, “JY AIR,” a new dimension in smart mobility. Focusing on the needs of modern drivers who seek cutting-edge technology, comfortable, safe, and eco-friendly vehicles. This marks a significant milestone in the company","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411210836H91RO0","origin_url":"https://www.bangkokpost.com/thailand/pr/2906216/rama-iv-welcomes-punn-green-office-for-all-generations-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241121/c1_2906216_700.jpg","title":"Rama IV Welcomes PUNN: Green Office for All Generations ","description":"As Bangkok’s office market evolves, the city’s Central Business District (CBD) continues to attract businesses with over 400,000 sq. m. of prime office space introduced in 2024. Among the standout developments is PUNN Smart Workspace, a new 28-storey office building located on Rama IV Road, a rapidly emerging hub for commerce, tourism, and lifestyle.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411210832H689TG","origin_url":"https://www.bangkokpost.com/thailand/pr/2906206/tcma-advocates-sustainable-waste-management-with-cement-kiln-technology-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241121/c1_2906206_700.jpg","title":"TCMA Advocates Sustainable Waste Management with Cement Kiln Technology ","description":"The Thai Cement Manufacturers Association (TCMA) is driving innovation in sustainable waste management by championing the co-processing of waste in cement kilns. This advanced method ensures safe waste disposal, reduces greenhouse gas emissions, and minimises landfill impact, aligning with the Zero Emission Concept.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411201022ZAXS61","origin_url":"https://www.bangkokpost.com/thailand/pr/2905603/aai-reports-283-profit-growth-eyes-continued-expansion-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905603_700.jpg","title":"AAI Reports 283% Profit Growth, Eyes Continued Expansion ","description":"Asian Alliance International Public Company Limited (AAI), a leading Thai pet food manufacturer, reported outstanding Q3/2024 performance, with revenue growth of 37.8% and a net profit increase of 145% compared to the same period last year. This was driven by increased demand in pet food business, which remains the primary growth driver. For the first nine months of this year, net profit surged by 283.4% compared to the same period last year, reflecting strong demand from major brand clients who launched new products tailored to owners seeking specialised pet food. The gross profit margin remains within the target of 20-21%. The company is confident that total revenue for this year will meet the target of THB 6,500 million, comprising THB 5,700 million from pet food business and THB 800 million from human shelf-stable food. Production capacity expansion plans are progressing as expected. In August, the company commenced dry pet food production under the “Pro” brand and expanded capacity for canned and pouch-packed products, which will increase wet pet food production to 59,000 tons per year by Q1 next year.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200947YV658C","origin_url":"https://www.bangkokpost.com/thailand/pr/2905582/wha-open-house-2024-a-first-look-inside-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905582_700.jpg","title":"WHA Open House 2024: A First Look Inside ","description":"WHA Corporation Public Company Limited (WHA Group) hosted  \"WHA Open House 2024: Explore – Discover – Shape the Future,\"  showcasing its business capabilities and delving into cutting-edge innovations and technologies across its four core business groups: Logistics, Industrial Estates, Utilities and Power, and Digital Solutions. The event highlighted WHA","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200947SHIL7T","origin_url":"https://www.bangkokpost.com/thailand/pr/2905592/dtgo-and-huawei-launch-thai-capable-ai-language-model-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e92b6208-bdd6-4ccc-b039-6007c0427b16","title":"DTGO and Huawei Launch Thai-Capable AI Language Model ","description":"Huawei Cloud and DTGO Corporation Limited (DTGO), a leading business group focused on social and environmental impact, have unveiled the world’s first large language model (LLM) designed for efficient performance in Thai, Chinese, and English. This groundbreaking innovation, DTLM, was launched on 18 November 2024 and developed using Huawei Cloud’s Ascend AI computing service. It aims to  revolutionise business functions such as management, customer service, and data analysis for organisations across Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200947P7VH5B","origin_url":"https://www.bangkokpost.com/thailand/pr/2905587/thaioil-achieves-excellent-cgr-rating-for-16th-consecutive-year-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/d0a41c86-4d05-4099-9c0d-21bbc5d62ad1","title":"Thaioil Achieves \"Excellent\" CGR Rating for 16th Consecutive Year ","description":"Thai Oil Public Company Limited ( Thaioil) has earned an “Excellent CGR Rating” for the 16th consecutive year, signified by the prestigious 5-symbol distinction—the highest level of recognition. The company is also ranked within the top quartile of listed companies with a market capitalisation of no less than 10 billion baht.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200906I9JHT0","origin_url":"https://www.bangkokpost.com/thailand/pr/2905557/fresh-off-the-runway-jaspal-groups-2024-scholarship-winners-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/f9ce0d85-83f3-48d6-8e1d-3d7ec0bcf81f","title":"Fresh Off the Runway: Jaspal Group’s 2024 Scholarship Winners ","description":"Jaspal Group solidifies its status as a leader in the fashion industry, driving Thailand’s fashion landscape forward with the Jaspal Group Scholarship  Programme 2024. Going beyond the award ceremony, the group hosted a captivating runway show that spotlighted the innovative designs of this year’s winners. Themed “The Power of Next,” the programme provided a platform for young designers nationwide to unleash their creativity, breathing fresh energy into Jaspal Group’s iconic brands.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200817M1UUQQ","origin_url":"https://www.bangkokpost.com/thailand/pr/2905543/bangchak-executive-highlights-asean-carbon-market-vision","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905543_700.jpg","title":"Bangchak Executive Highlights ASEAN Carbon Market Vision","description":"Gloyta Nathalang, Senior Executive Vice President of Sustainability Management and Corporate Communications at Bangchak Corporation and Chairperson of the Carbon Markets Club, took the stage at COP29 in Baku, Azerbaijan, to lead discussions on advancing the ASEAN carbon market. Representing Bangchak at two pivotal side event panels, she emphasised the need for regional cooperation and technological innovation to drive sustainable development.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112007165UV5BQ","origin_url":"https://www.bangkokpost.com/thailand/pr/2905498/porsche-world-roadshow-returns-to-thailands-tracks","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905498_700.jpg","title":"Porsche World Roadshow Returns to Thailand's Tracks","description":"Pathum Thani . It has long been said that the best way to experience a Porsche is behind the steering wheel; that is why the exhilarating Porsche World Roadshow (PWRS) is making a highly-anticipated return to Thailand after two years at the Pathum Thani Speedway.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200706WN5R8B","origin_url":"https://www.bangkokpost.com/thailand/pr/2905493/irpc-oil-renews-membership-in-anti-corruption-initiative","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905493_700.png","title":"IRPC Oil Renews Membership in Anti-Corruption Initiative","description":"IRPC Oil has reaffirmed its commitment to integrity and transparency by renewing its membership in the Thai Private Sector Collective Action Against Corruption (CAC).","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200702RCQ4SM","origin_url":"https://www.bangkokpost.com/thailand/pr/2904923/la-braci-opens-in-ploenchit-wood-fired-elegance","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904923_241120135110_700.jpg","title":"La Braci Opens in Ploenchit: Wood-Fired Elegance","description":"Nestled in the heart of Ploenchit","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411200456YHM8YX","origin_url":"https://www.bangkokpost.com/thailand/pr/2905466/why-copy-trade-with-hfm-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241120/c1_2905466_700.jpg","title":"Why Copy Trade with HFM?","description":"Copy the market moves of the most successful traders or share your own trading strategies via the HFM copy trading platform","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111911219ML384","origin_url":"https://www.bangkokpost.com/thailand/pr/2904936/true-and-partners-enhance-safety-with-cell-broadcast-system","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/aacbfadf-da7c-466a-878b-1c3bfed53007","title":"True and Partners Enhance Safety with Cell Broadcast System","description":"True Corporation Plc., Thailand’s leading telecom-tech company, joined forces with the National Broadcasting and Telecommunications Commission (NBTC), Ministry of Digital Economy and Society (DE), Department of Disaster Prevention and Mitigation (DDPM), and Phuket Province to conduct a live simulation of the “LIVE – Cell Broadcast Service” (CBS) in Phuket on 19 November 2024. This initiative is designed to elevate safety standards in one of Thailand’s most prominent tourist destinations and bolster visitor confidence.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191051IMSOTQ","origin_url":"https://www.bangkokpost.com/thailand/pr/2904858/will-the-thai-baht-decline-further-in-2024-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/62fc5bc6-e763-481e-8ca0-f2fdc4fee5e5","title":"Will the Thai Baht Decline Further in 2024?","description":"In the lead-up to the US election, the Baht rose steadily throughout 2024 but saw a significant shift at the end of September. It has since dropped by 7% and appears likely to continue depreciating. So, what happened?","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191036UV2S8R","origin_url":"https://www.bangkokpost.com/thailand/pr/2904787/onesiam-superapp-elevates-shopping-with-exclusive-member-rewards","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/47be2048-c767-4a0a-ab9d-0858de9f4838","title":"ONESIAM SuperApp Elevates Shopping with Exclusive Member Rewards","description":"ONESIAM SuperApp advances its smart platform transformation, elevating a universe of extraordinary experiences to new heights. It’s now set to deliver unparalleled privileges for valued customers of prestigious global projects. Siam Paragon, Siam Center, Siam Discovery, ICONSIAM, ICS, and Siam Premium Outlets Bangkok are joining forces with leading partners across diverse industries, including premium and luxury brands within the world-class premium business ecosystem. Together, they are creating unparalleled privileges and valuable experiences exclusively for ONESIAM members.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191026UKV83W","origin_url":"https://www.bangkokpost.com/thailand/pr/2904902/the-grand-return-of-pattaya-international-jazz-festival-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/9288883f-5346-4e91-9ebd-a3789fec113b","title":"The Grand Return of “Pattaya International Jazz Festival 2024”","description":"“Pattaya City” is set to host the grand-scale “Pattaya International Jazz Festival 2024” under the theme “The Harmonic Jazz & Beach.” This event will feature a free concert by world-renowned jazz artist Ronan Keating alongside numerous international and Thai jazz musicians, aiming to elevate Pattaya City to global prominence. The event is scheduled to take place on December 6 – 7, 2024, from 5:00 PM to midnight at Pattaya Beach, Chonburi.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191002LMQEC4","origin_url":"https://www.bangkokpost.com/thailand/pr/2904887/c-p-group-partners-with-zhejiang-university-to-drive-innovation","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904887_700.jpg","title":"C.P. Group Partners with Zhejiang University to Drive Innovation","description":"C.P. Group and Zhejiang University have joined forces to advance human capital development, innovation, and research across multiple disciplines, supporting global efforts to achieve a sustainable future.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSLY3UQ5.json"}