{"data":[{"code":"ART24111510068559K6","origin_url":"https://www.bangkokpost.com/thailand/pr/2902841/krirk-university-ranked-among-top-150-in-asia","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902841_700.png","title":"Krirk University Ranked Among Top 150 in Asia","description":"Krirk University has once again secured its place among Asia’s top 150 universities, ranking 141st overall and 5th in Thailand in the latest QS Asia University Rankings, hosted on November 6, 2024. This achievement, celebrated at the Asia-Pacific Higher Education Summit, held by Quacquarelli Symonds (QS) at Macau University of Science and Technology, marks the third consecutive year that Krirk University has reached this elite ranking. The summit, the largest higher education conference in the Asia-Pacific region organised by QS, also showcased the 2025 rankings, highlighting the university’s dedication to academic excellence and innovation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111510064QR6I0","origin_url":"https://www.bangkokpost.com/thailand/pr/2902832/unicef-launches-box-of-life-campaign-to-urgently-aid-children-in-crisis","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902832_241115160249_700.png","title":"UNICEF Launches “Box of Life” Campaign to Urgently Aid Children in Crisis","description":"UNICEF Thailand has unveiled the “Box of Life” campaign, rallying everyone to take action and donate essential aid to children in crisis. Part of the broader  “A Better Tomorrow Today”  initiative, the campaign aims to build a brighter future for underprivileged children in Thailand and worldwide, focusing on critical needs such as health, nutrition, disaster relief, and social equity.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411150959IMKJN1","origin_url":"https://www.bangkokpost.com/thailand/pr/2902823/five-star-chicken-showcasing-thai-soft-power-through-flavour","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902823_700.jpg","title":"Five Star Chicken: Showcasing Thai Soft Power through Flavour","description":"Thai cuisine is one of Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241115095939JRQB","origin_url":"https://www.bangkokpost.com/thailand/pr/2902796/thailand-honours-creativity-at-the-ce-awards-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902796_700.png","title":"Thailand Honours Creativity at the CE Awards 2024","description":"The Creative Economy Agency (CEA) hosted the Creative Excellence Awards 2024 to honour Thai creatives whose innovative work has made a meaningful impact on society, the environment, and the national economy.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111507403FW2OZ","origin_url":"https://www.bangkokpost.com/thailand/pr/2902787/irpc-secures-place-in-dow-jones-sustainability-indices-for-11th-year","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902787_700.jpg","title":"IRPC Secures Place in Dow Jones Sustainability Indices for 11th Year","description":"IRPC has once again proven its dedication to sustainability by securing its position in the prestigious Dow Jones Sustainability Indices (DJSI) for the 11th consecutive year. This recognition highlights the company","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411150648FJZ9T5","origin_url":"https://www.bangkokpost.com/thailand/pr/2902191/bayer-thai-wins-amcham-social-impact-award-for-6th-year","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241114/c1_2902191_700.png","title":"Bayer Thai Wins AMCHAM Social  Impact Award for 6th Year","description":"Bayer Thai Co., Ltd. has received the AMCHAM Corporate Social Impact Award for the year 2024, marking the 6th consecutive year (Gold Level Award) from the American Chamber of Commerce in Thailand (AMCHAM Thailand). The award ceremony took place recently at the Avani Plus Riverside Hotel in Bangkok, reaffirming the company","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411150502ES2K4I","origin_url":"https://www.bangkokpost.com/thailand/pr/2902733/bangkok-celebrates-italian-cuisines-unesco-heritage-candidacy","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241115/c1_2902733_700.png","title":"Bangkok Celebrates Italian Cuisine's UNESCO Heritage Candidacy","description":"In the presence of the Minister of Agriculture, Food Sovereignty and Forestry (MASAF), Mr Francesco Lollobrigida, the Italian Embassy in Bangkok and the Italian Trade Agency jointly hosted a lavish celebration of Italian cuisine","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411150336SASXFA","origin_url":"https://www.bangkokpost.com/thailand/pr/2902667/heygoody-wins-best-customer-centric-model-award-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/6a7f9bdb-367b-4514-b062-daf5ed273ef0","title":"heygoody Wins Best Customer-Centric Model Award 2024","description":"heygoody, a digital insurance brokerage platform powered by Ngern Tid Lor Public Company Limited (TIDLOR), has won the Best Customer-Centric Business Model award from the Global Retail Banking Innovation Awards 2024, hosted by The Digital Banker, a leading news agency specializing in financial and banking technology research. This award highlights the success of the heygoody platform in delivering a truly customer-focused brokerage service, designed to meet the needs of under-banked customers through advanced digital technology. Developed from in-depth customer insights, heygoody addresses the complexities of insurance comparison and privacy concerns often associated with telesales. heygoody offers an online platform where customers can purchase insurance independently, 24/7, aligning with today’s digital lifestyles.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111503363K2UFM","origin_url":"https://www.bangkokpost.com/thailand/pr/2902676/shield-insurance-wins-award-for-outstanding-omnichannel-integration","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/1aff5831-a9a6-4b68-b3f8-5cd7877cc8cc","title":"Shield Insurance Wins Award for Outstanding Omnichannel Integration","description":"Ngern Tid Lor Public Company Limited, also known as TIDLOR led Shield Insurance, its insurance brokerage to win an award in the  Outstanding Omnichannel Integration  title at the Global Retail Banking Innovation Awards 2024, hosted by The Digital Banker, a leading news agency specializing in financial and banking technology research. This recognition underscores the dedication to innovation and its development of advanced insurance brokerage solutions, enhancing service, sales, and communication channels to deliver exceptional customer experiences.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241115010764CDJX","origin_url":"https://www.bangkokpost.com/thailand/pr/2902111/siam-city-cement-group-sccc-reports-strong-q3-2024-performance-with-79-net-profit-growth","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/c3c3dc76-faa8-4bdf-898c-768957388985","title":"Siam City Cement Group (SCCC) Reports Strong Q3 2024 Performance with 79% Net Profit Growth","description":"Siam City Cement Group (SCCC) announced an impressive Q3 2024 financial performance, showcasing a substantial YoY net profit surged by 79% to THB 790 million and YoY EBITDA growth at 15%. This growth is driven by lower input costs, successful cost-control measures, efficiency improvements under the Group’s “FIT+” initiative, and a strong recovery in key markets, including Vietnam and Sri Lanka.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411141252J92ZLS","origin_url":"https://www.bangkokpost.com/thailand/pr/2902251/phyathai-paolo-wins-top-asia-award-for-healthcare-marketing","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241114/c1_2902251_700.png","title":"Phyathai-Paolo Wins Top Asia Award for Healthcare Marketing","description":"Phyathai-Paolo Hospital Group has been named “Asia’s Marketing Company of the Year 2024” at the Asia Marketing Excellence Awards, hosted by the Asia Marketing Federation (AMF) in the Philippines on November 8, 2024. This accolade highlights the group’s role in advancing Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411141232GUEK01","origin_url":"https://www.bangkokpost.com/thailand/pr/2902242/thailands-amazing-countdown-2025-lights-up-iconsiam","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/61fff31d-e08c-46dc-8066-e7958d8e3293","title":"Thailand's Amazing Countdown 2025 Lights Up ICONSIAM","description":"ICONSIAM, the global landmark along the Chao Phraya River—a joint venture between Siam Piwat, Charoen Pokphand Group (CP), and Magnolia Quality Development Corporation (MQDC)—reaffirms its status as a premier destination that showcases the best of Thailand to the world. By hosting the spectacular \"Amazing Thailand Countdown 2025,\" ICONSIAM aims to enhance Thailand’s global reputation, positioning the country as a countdown destination that captivates audiences worldwide. This countdown phenomenon promises to deliver Thailand’s and the world’s most impressive celebration, featuring the longest fireworks display along the Chao Phraya River, the debut solo performance by “Lisa Lalisa Manobal” (a global Thai icon), and a lineup of top-rated local and international artists. With an anticipated global audience of over 30 million, the \"Amazing Thailand Countdown 2025\" at ICONSIAM is set to significantly boost Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411141022ZCWCUD","origin_url":"https://www.bangkokpost.com/thailand/pr/2902196/rbsc-hosts-inaugural-taekwondo-championship-for-young-athletes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e3df7c67-58dc-435b-8fdf-ecd759b9ad0d","title":"RBSC Hosts Inaugural Taekwondo Championship for Young Athletes","description":"The Royal Bangkok Sports Club (RBSC) marked a significant milestone on Saturday, 9 November 2024, by hosting its first Taekwondo International Championship through its Martial Arts Club at Henri Dunant Hall. The 2024 competition, centred on poomsae, was organised into various age categories as follows:","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411140952OYSE06","origin_url":"https://www.bangkokpost.com/thailand/pr/2901507/jungceylon-unveils-dotoy-x-jungceylon-landmark-launching-angel-boy-to-boost-phuket-tourism","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/7e27869f-9881-4b0b-9727-b92c920a1a8d","title":"Jungceylon Unveils ‘DOTOY X JUNGCEYLON’ Landmark, Launching ‘Angel Boy’ to Boost Phuket Tourism","description":"Mr. Prawit Janyasittikul, Chief Executive Officer of Phuket Square Co., Ltd., which operates Jungceylon Shopping Center in Patong, Phuket, stated, “Jungceylon is a must-visit destination for tourists from around the world when they travel to Patong, Phuket. The rising global popularity of art toys and collectible toys, which appeal to all ages and convey meaning beyond language, highlights a unique connection between ‘art toys’ and ‘Jungceylon.’ Through collaboration with world-renowned artists, we have created ‘DOTOY X JUNGCEYLON’ as a year-end gift, welcoming the New Year 2025 for both Phuket residents and international tourists.”","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411140952DI99C2","origin_url":"https://www.bangkokpost.com/thailand/pr/2902183/bangchak-earns-top-sustainability-score-from-sp-global-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e56eb7f7-7131-4ec7-91bd-535e0c7afdcd","title":"Bangchak Earns Top Sustainability Score from S&P Global 2024","description":"Bangchak Corporation Public Company Limited has received the highest sustainability assessment in the Oil & Gas Refining and Marketing industry from the S&P Global Corporate Sustainability Assessment (CSA) 2024. This achievement underscores Bangchak’s dedication to sustainable operations and its ongoing commitment to social and environmental responsibility, reaffirming its status as a globally recognised leader in sustainability.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411140937PPF8VJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2902176/bangchaks-14th-greenovative-forum-sustainable-energy-meets-ai","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/7d0b8b70-f10f-4fb5-8e70-1e3874a0aa20","title":"Bangchak’s 14th Greenovative Forum: Sustainable Energy Meets AI","description":"Bangchak Group, in collaboration with The Standard news agency, is hosting the 14th Greenovative Forum titled  Crafting Tomorrow’s Future with Sustainable Energy and AI , now to be held at True Digital Park West, Sukhumvit 101 (BTS Punnawithi, Exit 6) on Friday, 29 November 2024, from 08:45 to 12:00. This change from the original venue at M Tower, Bangchak Head Office, follows high interest from participants.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411140937L7A71P","origin_url":"https://www.bangkokpost.com/thailand/pr/2902172/bsrc-gistda-and-zoological-park-partner-for-wildlife-conservation","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/6196e824-8d9c-48af-af2d-22e272405887","title":"BSRC, GISTDA, and Zoological Park Partner for Wildlife Conservation","description":"Bangchak Sriracha Public Company Limited (BSRC) has entered a landmark partnership with the Geo-Informatics and Space Technology Development Agency (GISTDA) and the Zoological Park Organization under the Royal Patronage of H.M. The King, aimed at protecting endangered wildlife through space and geoinformatics technology. The collaboration, formalised through a Memorandum of Understanding (MoU), was signed at Thailand Space Week 2024 at IMPACT Muang Thong Thani on 7 November.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411140937IWIC7B","origin_url":"https://www.bangkokpost.com/thailand/pr/2902177/luxury-meets-colour-axor-and-homes-vibrant-bathroom-workshop","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/9e684a04-1fe4-402d-ba78-4e36f239f399","title":"Luxury Meets Colour: AXOR and Home's Vibrant Bathroom Workshop","description":"Crystal Home, Thailand’s premier distributor of luxury bathroom products, recently collaborated with AXOR, the German bathroom brand renowned for its high-end design, to host an exclusive workshop at Soho House Bangkok. Themed The Power of Colours, the event attracted top architects, designers, and media representatives for an inspiring session on using vibrant hues in luxury bathroom spaces.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111310522FDHQT","origin_url":"https://www.bangkokpost.com/thailand/pr/2901563/true-corp-showcases-emergency-alert-system-with-live-test","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241113/c1_2901563_700.png","title":"True Corp Showcases Emergency Alert System with Live Test","description":"True Corporation Plc., Thailand’s leading telecom-tech company, conducted a live demonstration of its “LIVE – Cell Broadcast Service,” showcasing the system’s readiness for the Committee on Communications, Telecommunications, and Digital Economy and Society of the House of Representatives. The event welcomed Mr Pakornwut Udompipatskul, (Second) Vice-Chairperson of the Committee, along with subcommittee members, to witness and participate in testing the emergency alert system, which will be launched in Thailand for the first time. Attendees also toured the Business and Network Intelligence Centre (BNIC), which is utilised for disaster management.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130936DFAK65","origin_url":"https://www.bangkokpost.com/thailand/pr/2901553/taiwan-excellences-day-of-giving-waste-to-solutions","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241113/c1_2901553_241113162107_700.jpg","title":"Taiwan Excellence’s Day of Giving: Waste to Solutions","description":"Taiwan Excellence brought together over 100 dedicated volunteers for the Day of Giving project, a corporate social responsibility (CSR) initiative focused on uplifting communities and protecting the environment. Aligned with Taiwan Excellence’s mission to support impactful CSR activities annually, this year’s Day of Giving emphasised environmental conservation and community empowerment. Volunteers learned innovative methods to turn waste into resources, helping to reduce pollution, safeguard natural water sources, and create sustainable income for local communities.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241113070299R559","origin_url":"https://www.bangkokpost.com/thailand/pr/2900186/get-venture-drives-growth-for-thai-smes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/95f6168e-65e5-4f8b-ab28-b1a4f4992c40","title":"GET Venture Drives Growth for Thai SMEs","description":"GET Venture has announced an ambitious growth trajectory for 2024, with Chief Executive Officer Mr. Natt Kasemakrakvipas sharing optimistic insights. This year is set to be transformative for GET Venture, as the firm aims to achieve a 300 million THB investment portfolio in 2024, with a target of reaching 750 million THB by 2025.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130451MCD79T","origin_url":"https://www.bangkokpost.com/thailand/pr/2901422/etix-everywhere-expands-data-centre-presence-in-thailand","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/063cf481-29a8-4420-9f44-39640de5bd60","title":"ETIX Everywhere Expands Data Centre Presence in Thailand","description":"ETIX Everywhere has announced a 1 billion baht investment aimed at solidifying its presence in Thailand’s data centre market. This investment will be allocated towards a share buyout of joint venture partner Interlink Telecom, as well as the construction of an additional data centre extension for ETIX Bangkok#1. This initiative highlights ETIX’s commitment to becoming a key player in Southeast Asia’s evolving data centre landscape.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130451FUXLVC","origin_url":"https://www.bangkokpost.com/thailand/pr/2901427/irpc-and-partners-drive-anti-corruption-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241113/c1_2901427_700.png","title":"IRPC and Partners Drive Anti-Corruption for Sustainable Growth","description":"IRPC Public Co., Ltd. (IRPC), led by President and CEO Terdkiat Prommool, recently inaugurated the \"Supplier Conference 2024\" under the theme “Let’s Connect Together: Step Forward with Creativity to Sustainability.” Held as a hybrid event at The Synergy Hall, EnCo C, the conference brought together over 500 participants, aiming to foster strong partnerships for sustainable, transparent, and corruption-free business practices.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111304321CQC29","origin_url":"https://www.bangkokpost.com/thailand/pr/2901413/uob-thailand-wins-triple-awards-elevates-retail-banking-partnerships","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/463a6d48-7c29-4449-8227-e70a7d39be11","title":"UOB Thailand Wins Triple Awards, Elevates Retail Banking Partnerships","description":"UOB Thailand has won three awards from esteemed regional award forums, including Best Foreign Retail Bank in Thailand from  International Finance , the ABF Retail Banking Awards 2024 from  The Asian Banking and Finance , and the TAB Global Excellence in Retail Financial Services Awards 2024 from  The Asian Banker . These accolades reflect the bank","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130246PVDIOM","origin_url":"https://www.bangkokpost.com/thailand/pr/2901396/irpc-and-partners-drive-anti-corruption-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/28185819-0194-4cb1-81d2-63452a58e079","title":"IRPC and Partners Drive Anti-Corruption for Sustainable Growth","description":"IRPC Public Co., Ltd. (IRPC), led by President and CEO Terdkiat Prommool, recently inaugurated the \"Supplier Conference 2024\" under the theme “Let’s Connect Together: Step Forward with Creativity to Sustainability.” Held as a hybrid event at The Synergy Hall, EnCo C, the conference brought together over 500 participants, aiming to foster strong partnerships for sustainable, transparent, and corruption-free business practices.","status":"FINISH","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111302064UPCU1","origin_url":"https://www.bangkokpost.com/thailand/pr/2900762/maurice-lacroix-unveils-limited-edition-aikon-with-pond-review","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ab01e48b-a234-47eb-83e1-82d90896d7e2","title":"Maurice Lacroix Unveils Limited Edition AIKON with Pond Review","description":"Maurice Lacroix, the renowned Swiss luxury watch brand, once again stirs excitement with the release of a special edition timepiece: the Maurice Lacroix X Pond Review AIKON Automatic Limited Edition 39mm. This model embodies the brand’s belief that the modern urban lifestyle is all about uniqueness, self-expression, and carving out a personal path. Maurice Lacroix expresses this philosophy: “Rather than following others, individuals proudly wear watches they select and cherish. Although popular models, they must possess a clear, unique distinction.” Over the years, Maurice Lacroix has continuously captured collectors","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130111W1NDQ3","origin_url":"https://www.bangkokpost.com/thailand/pr/2900957/brighton-college-bangkok-expands-with-new-vibhavadi-branch","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/92d7c4b2-0ef3-4000-825b-74b48635cdb5","title":"Brighton College Bangkok Expands with New Vibhavadi Branch","description":"In a landmark development for Thailand’s education sector, Brighton College Bangkok will extend its acclaimed British curriculum to a new Vibhavadi branch in 2025. This expansion reinforces the Assakul family’s vision of providing world-class education within the country, led by Nusara (Assakul) Banyatpiyaphod, Chair of The Brighton College Bangkok Board. A commitment to fostering well-rounded anchors the school’s focus on academic excellence and culturally aware students who excel in Thai and international contexts.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120922LSKU6T","origin_url":"https://www.bangkokpost.com/thailand/pr/2900892/fxgt-com-launches-innovative-fxgt-app-and-trader-platform","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/452b0507-c32f-442c-a381-9de3d8bd9758","title":"FXGT.com Launches Innovative FXGT App and Trader Platform","description":"In an era where technology is reshaping the landscape of online trading, FXGT.com has officially launched two innovative products designed to enhance the trading journey for all users: the FXGT App and FXGT.com Trader. These tools exemplify the company’s commitment to providing a seamless, powerful, and secure trading environment that adapts to the needs of modern traders.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120906Y9432V","origin_url":"https://www.bangkokpost.com/thailand/pr/2900886/mint-reports-19-core-profit-growth-for-9m24-poised-for-strong-q4-and-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241112/c1_2900886_700.jpg","title":"MINT Reports 19% Core Profit Growth for 9M24 Poised for Strong Q4 and 2024","description":"Minor International Public Company Limited (MINT)  has announced core net profit of THB 5,514 million for the first nine months of 2024, a 19% year-on-year increase. Core EBITDA grew 11% year-on-year to THB 33,623 million, powered by a 9% rise in core revenue driven by outstanding performances in MINT’s hospitality and restaurant businesses. This strong growth was driven by effective revenue optimisation, resulting in increased ADR and RevPAR across MINT’s hotel portfolio, together with sustained cost discipline.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120826ZBLVVP","origin_url":"https://www.bangkokpost.com/thailand/pr/2900868/teaching-english-in-bangkok-is-this-the-right-city-for-you-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241112/c1_2900868_700.jpg","title":"Teaching English in Bangkok: Is This the Right City for You?","description":"Bangkok is a city that truly stands out – a colourful mix of ancient temples, bustling markets, and glittering skyscrapers. As Thailand’s vibrant capital, it’s a magnet for travellers, expats, and anyone in search of new experiences. But beyond the temples and street food, Bangkok is also a top choice for people looking to teach English abroad. With a high demand for English teachers, modern amenities, and a wide range of job opportunities, the city has become a favourite destination for aspiring teachers.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120826Q531BW","origin_url":"https://www.bangkokpost.com/thailand/pr/2900858/boghossians-high-jewellery-tribute-to-bangkoks-grand-palace","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/a31b3755-a293-4fd7-ac68-17a520b7be20","title":"Boghossian’s High Jewellery Tribute to Bangkok’s Grand Palace","description":"Renowned Swiss jeweller Boghossian has chosen Bangkok for the debut of its “Palace Voyages” high jewellery collection in Thailand. From 11 to 13 November 2024, the Mandarin Oriental Bangkok will host a Luncheon and Private Showcase, unveiling 13 exquisite pieces that capture the enchanting spirit of some of the world’s most celebrated palaces, including Thailand’s Grand Palace, Beijing’s Qianlong Palace, and England’s Brighton Pavilion.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120632A3KU7R","origin_url":"https://www.bangkokpost.com/thailand/pr/2900821/a-royal-feast-5-chefs-10-hands-delights-bangkok","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/8f02a1d0-c3eb-4310-9b93-05c709b28fc1","title":"A Royal Feast: “5 Chefs 10 Hands” Delights Bangkok","description":"Pullman Bangkok King Power recently hosted a night of culinary opulence with “5 Chefs 10 Hands: The Night of Romanov,” a two-night event held on October 31 and November 1. This exclusive dining experience was a journey into royal splendour, featuring a luxurious 10-course menu crafted by five esteemed chefs. Signature dishes included langoustine with Prunier Oscietra caviar and an extraordinary creation of imperial beluga caviar with egg yolk ice, transporting guests to a world of fine flavours and elegant presentation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111203165XWENO","origin_url":"https://www.bangkokpost.com/thailand/pr/2900732/irpc-and-narit-partner-to-boost-commercial-innovation","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ca793333-35e8-42a6-90bf-62eb8de4710f","title":"IRPC and NARIT Partner to Boost Commercial Innovation","description":"IRPC Public Company Limited, represented by Mr. Anucha Somjitchob, Executive Vice President of the IRPC Innovation Center, has entered into a Memorandum of Understanding (MoU) with the National Astronomical Research Institute of Thailand (NARIT), led by Dr. Saran Poshyachinda, Executive Director of NARIT. Signed on October 22, 2024, this collaboration aims to drive research and development, advancing innovations for commercial applications. By integrating expertise in astronomy, engineering, technology, and innovation, along with practical operational experience, the partnership seeks to maximise mutual benefits.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411111221ZVTVE8","origin_url":"https://www.bangkokpost.com/thailand/pr/2900161/enco-wins-thailands-2024-best-green-building-award","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241111/c1_2900161_700.png","title":"EnCo Wins Thailand’s 2024 Best Green Building Award","description":"Energy Complex Co., Ltd. (EnCo) proudly continues its leadership in energy management and green building, recently winning the “Best Green Building and Energy Efficiency Award Thailand 2024” from World Business Outlook, a prominent Singapore-based print and online magazine covering the financial industry, international business, and the global economy. This accolade honours organisations distinguished by exemplary business operations, innovative practices, and global recognition. Mrs. Kittiya Bantadchan, Vice President of Corporate Strategy, Business Development, and Marketing, accepted the award on behalf of EnCo at the Bangkok Marriott Marquis Queen","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411111106OFM61C","origin_url":"https://www.bangkokpost.com/thailand/pr/2900218/experience-the-magnificent-vijit-chao-phraya-festival","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/3793417f-30cc-4893-a071-b2328ea25387","title":"Experience the Magnificent Vijit Chao Phraya Festival","description":"Vijit Chao Phraya  is a spectacular festival of lights, colour, and sound held along the Chao Phraya River to celebrate and promote Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111109512UOR2N","origin_url":"https://www.bangkokpost.com/thailand/pr/2900172/cloudnurse-launches-thailands-first-digital-elderly-care-platform","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/0e94c011-2581-47a4-b933-dcb0420654a6","title":"CloudNurse Launches Thailand’s First Digital Elderly Care Platform","description":"Recognising Thailand’s rapidly growing elderly population, CloudNurse has launched the nation’s first comprehensive digital platform tailored for senior care facilities. The platform integrates electronic health records (EHR) and management tools to streamline operations, reduce paperwork, and ultimately enhance the quality of care. Designed with ease of use and accessibility in mind, CloudNurse aims to set a new standard for elder care management in Thailand and beyond.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111105211RYO8N","origin_url":"https://www.bangkokpost.com/thailand/pr/2900073/natures-finest-water-delivered-with-mindful-elegance-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241111/c1_2900073_700.jpg","title":"Nature's Finest Water, Delivered with Mindful Elegance\"","description":"TARA SPRINGS  100% natural mineral water embodies the life force of Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411081152B2K7NF","origin_url":"https://www.bangkokpost.com/thailand/pr/2898743/tap-wins-triple-crown-in-national-sustainability-awards","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/b88e651e-537c-4247-a14b-28c4cebf0ac0","title":"TAP Wins Triple Crown in National Sustainability Awards","description":"Thai Asia Pacific Brewery Co., Ltd. (TAP) reinforces its sustainability success through business operations under the Brew a Better World strategy, which received quality awards from government agencies, including the Green Industry Level 4: Green Culture standard award from the Ministry of Industry, Energy Beyond Standards 2024 certificate from the Department of Alternative Energy Development and Efficiency, Ministry of Energy, and an Honorary Plaque for Zero Accident Campaign from the Thailand Institute of Occupational Safety and Health (TOSH), Ministry of Labour.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSLKQU41.json"}