{"data":[{"code":"ART241113070299R559","origin_url":"https://www.bangkokpost.com/thailand/pr/2900186/get-venture-drives-growth-for-thai-smes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/95f6168e-65e5-4f8b-ab28-b1a4f4992c40","title":"GET Venture Drives Growth for Thai SMEs","description":"GET Venture has announced an ambitious growth trajectory for 2024, with Chief Executive Officer Mr. Natt Kasemakrakvipas sharing optimistic insights. This year is set to be transformative for GET Venture, as the firm aims to achieve a 300 million THB investment portfolio in 2024, with a target of reaching 750 million THB by 2025.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130451MCD79T","origin_url":"https://www.bangkokpost.com/thailand/pr/2901422/etix-everywhere-expands-data-centre-presence-in-thailand","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/063cf481-29a8-4420-9f44-39640de5bd60","title":"ETIX Everywhere Expands Data Centre Presence in Thailand","description":"ETIX Everywhere has announced a 1 billion baht investment aimed at solidifying its presence in Thailand’s data centre market. This investment will be allocated towards a share buyout of joint venture partner Interlink Telecom, as well as the construction of an additional data centre extension for ETIX Bangkok#1. This initiative highlights ETIX’s commitment to becoming a key player in Southeast Asia’s evolving data centre landscape.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130451FUXLVC","origin_url":"https://www.bangkokpost.com/thailand/pr/2901427/irpc-and-partners-drive-anti-corruption-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241113/c1_2901427_700.png","title":"IRPC and Partners Drive Anti-Corruption for Sustainable Growth","description":"IRPC Public Co., Ltd. (IRPC), led by President and CEO Terdkiat Prommool, recently inaugurated the \"Supplier Conference 2024\" under the theme “Let’s Connect Together: Step Forward with Creativity to Sustainability.” Held as a hybrid event at The Synergy Hall, EnCo C, the conference brought together over 500 participants, aiming to foster strong partnerships for sustainable, transparent, and corruption-free business practices.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111304321CQC29","origin_url":"https://www.bangkokpost.com/thailand/pr/2901413/uob-thailand-wins-triple-awards-elevates-retail-banking-partnerships","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/463a6d48-7c29-4449-8227-e70a7d39be11","title":"UOB Thailand Wins Triple Awards, Elevates Retail Banking Partnerships","description":"UOB Thailand has won three awards from esteemed regional award forums, including Best Foreign Retail Bank in Thailand from  International Finance , the ABF Retail Banking Awards 2024 from  The Asian Banking and Finance , and the TAB Global Excellence in Retail Financial Services Awards 2024 from  The Asian Banker . These accolades reflect the bank","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130246PVDIOM","origin_url":"https://www.bangkokpost.com/thailand/pr/2901396/irpc-and-partners-drive-anti-corruption-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/28185819-0194-4cb1-81d2-63452a58e079","title":"IRPC and Partners Drive Anti-Corruption for Sustainable Growth","description":"IRPC Public Co., Ltd. (IRPC), led by President and CEO Terdkiat Prommool, recently inaugurated the \"Supplier Conference 2024\" under the theme “Let’s Connect Together: Step Forward with Creativity to Sustainability.” Held as a hybrid event at The Synergy Hall, EnCo C, the conference brought together over 500 participants, aiming to foster strong partnerships for sustainable, transparent, and corruption-free business practices.","status":"FINISH","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111302064UPCU1","origin_url":"https://www.bangkokpost.com/thailand/pr/2900762/maurice-lacroix-unveils-limited-edition-aikon-with-pond-review","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ab01e48b-a234-47eb-83e1-82d90896d7e2","title":"Maurice Lacroix Unveils Limited Edition AIKON with Pond Review","description":"Maurice Lacroix, the renowned Swiss luxury watch brand, once again stirs excitement with the release of a special edition timepiece: the Maurice Lacroix X Pond Review AIKON Automatic Limited Edition 39mm. This model embodies the brand’s belief that the modern urban lifestyle is all about uniqueness, self-expression, and carving out a personal path. Maurice Lacroix expresses this philosophy: “Rather than following others, individuals proudly wear watches they select and cherish. Although popular models, they must possess a clear, unique distinction.” Over the years, Maurice Lacroix has continuously captured collectors","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411130111W1NDQ3","origin_url":"https://www.bangkokpost.com/thailand/pr/2900957/brighton-college-bangkok-expands-with-new-vibhavadi-branch","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/92d7c4b2-0ef3-4000-825b-74b48635cdb5","title":"Brighton College Bangkok Expands with New Vibhavadi Branch","description":"In a landmark development for Thailand’s education sector, Brighton College Bangkok will extend its acclaimed British curriculum to a new Vibhavadi branch in 2025. This expansion reinforces the Assakul family’s vision of providing world-class education within the country, led by Nusara (Assakul) Banyatpiyaphod, Chair of The Brighton College Bangkok Board. A commitment to fostering well-rounded anchors the school’s focus on academic excellence and culturally aware students who excel in Thai and international contexts.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120922LSKU6T","origin_url":"https://www.bangkokpost.com/thailand/pr/2900892/fxgt-com-launches-innovative-fxgt-app-and-trader-platform","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/452b0507-c32f-442c-a381-9de3d8bd9758","title":"FXGT.com Launches Innovative FXGT App and Trader Platform","description":"In an era where technology is reshaping the landscape of online trading, FXGT.com has officially launched two innovative products designed to enhance the trading journey for all users: the FXGT App and FXGT.com Trader. These tools exemplify the company’s commitment to providing a seamless, powerful, and secure trading environment that adapts to the needs of modern traders.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120906Y9432V","origin_url":"https://www.bangkokpost.com/thailand/pr/2900886/mint-reports-19-core-profit-growth-for-9m24-poised-for-strong-q4-and-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241112/c1_2900886_700.jpg","title":"MINT Reports 19% Core Profit Growth for 9M24 Poised for Strong Q4 and 2024","description":"Minor International Public Company Limited (MINT)  has announced core net profit of THB 5,514 million for the first nine months of 2024, a 19% year-on-year increase. Core EBITDA grew 11% year-on-year to THB 33,623 million, powered by a 9% rise in core revenue driven by outstanding performances in MINT’s hospitality and restaurant businesses. This strong growth was driven by effective revenue optimisation, resulting in increased ADR and RevPAR across MINT’s hotel portfolio, together with sustained cost discipline.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120826ZBLVVP","origin_url":"https://www.bangkokpost.com/thailand/pr/2900868/teaching-english-in-bangkok-is-this-the-right-city-for-you-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241112/c1_2900868_700.jpg","title":"Teaching English in Bangkok: Is This the Right City for You?","description":"Bangkok is a city that truly stands out – a colourful mix of ancient temples, bustling markets, and glittering skyscrapers. As Thailand’s vibrant capital, it’s a magnet for travellers, expats, and anyone in search of new experiences. But beyond the temples and street food, Bangkok is also a top choice for people looking to teach English abroad. With a high demand for English teachers, modern amenities, and a wide range of job opportunities, the city has become a favourite destination for aspiring teachers.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120826Q531BW","origin_url":"https://www.bangkokpost.com/thailand/pr/2900858/boghossians-high-jewellery-tribute-to-bangkoks-grand-palace","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/a31b3755-a293-4fd7-ac68-17a520b7be20","title":"Boghossian’s High Jewellery Tribute to Bangkok’s Grand Palace","description":"Renowned Swiss jeweller Boghossian has chosen Bangkok for the debut of its “Palace Voyages” high jewellery collection in Thailand. From 11 to 13 November 2024, the Mandarin Oriental Bangkok will host a Luncheon and Private Showcase, unveiling 13 exquisite pieces that capture the enchanting spirit of some of the world’s most celebrated palaces, including Thailand’s Grand Palace, Beijing’s Qianlong Palace, and England’s Brighton Pavilion.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411120632A3KU7R","origin_url":"https://www.bangkokpost.com/thailand/pr/2900821/a-royal-feast-5-chefs-10-hands-delights-bangkok","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/8f02a1d0-c3eb-4310-9b93-05c709b28fc1","title":"A Royal Feast: “5 Chefs 10 Hands” Delights Bangkok","description":"Pullman Bangkok King Power recently hosted a night of culinary opulence with “5 Chefs 10 Hands: The Night of Romanov,” a two-night event held on October 31 and November 1. This exclusive dining experience was a journey into royal splendour, featuring a luxurious 10-course menu crafted by five esteemed chefs. Signature dishes included langoustine with Prunier Oscietra caviar and an extraordinary creation of imperial beluga caviar with egg yolk ice, transporting guests to a world of fine flavours and elegant presentation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111203165XWENO","origin_url":"https://www.bangkokpost.com/thailand/pr/2900732/irpc-and-narit-partner-to-boost-commercial-innovation","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ca793333-35e8-42a6-90bf-62eb8de4710f","title":"IRPC and NARIT Partner to Boost Commercial Innovation","description":"IRPC Public Company Limited, represented by Mr. Anucha Somjitchob, Executive Vice President of the IRPC Innovation Center, has entered into a Memorandum of Understanding (MoU) with the National Astronomical Research Institute of Thailand (NARIT), led by Dr. Saran Poshyachinda, Executive Director of NARIT. Signed on October 22, 2024, this collaboration aims to drive research and development, advancing innovations for commercial applications. By integrating expertise in astronomy, engineering, technology, and innovation, along with practical operational experience, the partnership seeks to maximise mutual benefits.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411111221ZVTVE8","origin_url":"https://www.bangkokpost.com/thailand/pr/2900161/enco-wins-thailands-2024-best-green-building-award","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241111/c1_2900161_700.png","title":"EnCo Wins Thailand’s 2024 Best Green Building Award","description":"Energy Complex Co., Ltd. (EnCo) proudly continues its leadership in energy management and green building, recently winning the “Best Green Building and Energy Efficiency Award Thailand 2024” from World Business Outlook, a prominent Singapore-based print and online magazine covering the financial industry, international business, and the global economy. This accolade honours organisations distinguished by exemplary business operations, innovative practices, and global recognition. Mrs. Kittiya Bantadchan, Vice President of Corporate Strategy, Business Development, and Marketing, accepted the award on behalf of EnCo at the Bangkok Marriott Marquis Queen","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411111106OFM61C","origin_url":"https://www.bangkokpost.com/thailand/pr/2900218/experience-the-magnificent-vijit-chao-phraya-festival","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/3793417f-30cc-4893-a071-b2328ea25387","title":"Experience the Magnificent Vijit Chao Phraya Festival","description":"Vijit Chao Phraya  is a spectacular festival of lights, colour, and sound held along the Chao Phraya River to celebrate and promote Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111109512UOR2N","origin_url":"https://www.bangkokpost.com/thailand/pr/2900172/cloudnurse-launches-thailands-first-digital-elderly-care-platform","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/0e94c011-2581-47a4-b933-dcb0420654a6","title":"CloudNurse Launches Thailand’s First Digital Elderly Care Platform","description":"Recognising Thailand’s rapidly growing elderly population, CloudNurse has launched the nation’s first comprehensive digital platform tailored for senior care facilities. The platform integrates electronic health records (EHR) and management tools to streamline operations, reduce paperwork, and ultimately enhance the quality of care. Designed with ease of use and accessibility in mind, CloudNurse aims to set a new standard for elder care management in Thailand and beyond.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111105211RYO8N","origin_url":"https://www.bangkokpost.com/thailand/pr/2900073/natures-finest-water-delivered-with-mindful-elegance-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241111/c1_2900073_700.jpg","title":"Nature's Finest Water, Delivered with Mindful Elegance\"","description":"TARA SPRINGS  100% natural mineral water embodies the life force of Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411081152B2K7NF","origin_url":"https://www.bangkokpost.com/thailand/pr/2898743/tap-wins-triple-crown-in-national-sustainability-awards","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/b88e651e-537c-4247-a14b-28c4cebf0ac0","title":"TAP Wins Triple Crown in National Sustainability Awards","description":"Thai Asia Pacific Brewery Co., Ltd. (TAP) reinforces its sustainability success through business operations under the Brew a Better World strategy, which received quality awards from government agencies, including the Green Industry Level 4: Green Culture standard award from the Ministry of Industry, Energy Beyond Standards 2024 certificate from the Department of Alternative Energy Development and Efficiency, Ministry of Energy, and an Honorary Plaque for Zero Accident Campaign from the Thailand Institute of Occupational Safety and Health (TOSH), Ministry of Labour.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110810529QB0S2","origin_url":"https://www.bangkokpost.com/thailand/pr/2898748/krungsri-ceo-yamato-honoured-for-sustainable-finance-leadership","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/540cf18f-e5c9-45e9-add0-c289987108f4","title":"Krungsri CEO Yamato Honoured for Sustainable Finance Leadership","description":"The prestigious CEO of the Year in Sustainable Finance award at Bangkok Post CEO of the Year 2024 has been presented to Mr Kenichi Yamato, Krungsri President and Chief Executive Officer. Mr Phumtham Wechayachai, Deputy Prime Minister and Minister of Defence, presented the honour at a ceremony held at Centara Grand at Central World. Now in its third year, this distinguished Bangkok Post award recognises exceptional leadership and management excellence among CEOs across various business organisations, celebrating their visionary approach and outstanding achievements.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411081037CO9861","origin_url":"https://www.bangkokpost.com/thailand/pr/2898738/central-launches-elite-shopping-program-for-thailand-expats","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/473fd0c9-90c6-4eb7-85b5-55aaf0bf7bc7","title":"Central Launches Elite Shopping Program for Thailand Expats","description":"Central Department Store Group, under Central Retail, has partnered with The 1—Thailand’s largest digital lifestyle and loyalty platform with over 21 million members—to launch The 1 EXPAT, a membership program that redefines the shopping experience for expatriates in Thailand. Integrated within The 1 APP, The 1 EXPAT is designed to provide expats with not only tailored shopping privileges but also access to a vibrant community and unique O2O (online-to-offline) experiences crafted specifically for their lifestyle.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411081006CJ7CH8","origin_url":"https://www.bangkokpost.com/thailand/pr/2898716/rattan-meets-watchmaking-art-transforms-luxury-retail","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/cc3eb8ba-fb49-4985-a645-b7d2f6857f2a","title":"Rattan Meets Watchmaking: Art Transforms Luxury Retail","description":"Vacheron Constantin and Enter Projects Asia present “PROJECT RATTAN – FROM GEOMETRY TO ARTISTRY”, an artistic collaboration with Thai rattan artisans at the Vacheron Constantin Siam Paragon Boutique, Bangkok. Aligned with Vacheron Constantin’s annual theme, “From Geometry to Artistry”, the project features a collection of artisanal sculptures adorning the boutique ceiling and window display, showcasing the art of rattan weaving shaped into geometric forms, pioneering a new level of tactile and immersive retail experience. Staying true to its motto, \"Do better if possible, and that is always possible.\"","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411080836XH0MTT","origin_url":"https://www.bangkokpost.com/thailand/pr/2898673/gac-aion-partners-with-boi-to-source-thai-suppliers-at-aion-sourcing-day","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/d6d75181-84cd-4a68-acf4-71f87b24b477","title":"GAC AION Partners with BOI to Source Thai Suppliers at “AION Sourcing Day”","description":"GAC AION, a major Chinese electric vehicle manufacturer, partnered with Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411080802DO6L88","origin_url":"https://www.bangkokpost.com/thailand/pr/2898667/-thainakarin-hospital-welcomes-russian-delegation-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/f6de7a62-4ac6-4cb9-a3f2-3330e6a95c0a","title":"\"Thainakarin Hospital Welcomes Russian Delegation\"","description":"Thainakarin Hospital, under the leadership of Clinical Prof. Dr. Tipchart Punyaratabandhu, Hospital Director and Medical Director, and Dr. Watson Aphiwattanakoon, Administrative Director, recently hosted a distinguished group of public health officials, international economic affairs executives, physicians, and hospital directors from Russia. The visit was focused on exploring potential partnerships to refer patients seeking advanced cancer care and other treatments.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110807325POGLO","origin_url":"https://www.bangkokpost.com/thailand/pr/2898658/irpc-drives-innovation-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/5ef41d1e-8624-4c47-aa8c-4d320b5774ae","title":"IRPC Drives Innovation for Sustainable Growth","description":"IRPC forecasts a surge in oil demand during the winter season. The forecast aligns with the petrochemical group","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411080652YOZ6KW","origin_url":"https://www.bangkokpost.com/thailand/pr/2898631/celebrate-gundams-45th-anniversary-at-siam-paragon-exhibition","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/bc066afc-6d01-4d34-b9bc-8768fcab767d","title":"Celebrate Gundam’s 45th Anniversary at Siam Paragon Exhibition","description":"The wait is finally over for Gunpla fans! Dream Toy Co., Ltd., the official importer and distributor of Bandai toys and collectibles from Japan, in collaboration with Siam Paragon and Siam Center, is set to offer an unparalleled experience with \"BANDAI SPIRIT HOBBY EXHIBITIONS 2024\". The event marks the 45th anniversary of Gundam, the popular Japanese anime series, featuring a much-anticipated Gundam showcase and activities. Under the theme \"Fun to Build\", the exhibition will take place across two venues, from today until 17 November 2024 at Parc Paragon, Siam Paragon, with the \"GUNPLA Builders World Cup in Thailand (GBWC) 2024\" also featured at Siam Center’s Atrium 1 from 13-17 November 2024.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070852BZK21U","origin_url":"https://www.bangkokpost.com/thailand/pr/2898001/ccpit-green-tech-expo-highlights-lancang-mekong-collaboration","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/abef34ae-478c-419e-8a18-207201603783","title":"CCPIT Green Tech Expo Highlights Lancang-Mekong Collaboration","description":"The China Council for the Promotion of International Trade (CCPIT) announced the success of the \"Lancang-Mekong Green Cooperation Exhibition\" held recently at the Bangkok International Trade & Exhibition Centre (BITEC) in Bangkok, Thailand. The event attracted thousands of attendees and significantly raised awareness by showcasing collaborative achievements in the Lancang-Mekong region, reflecting a decade of prosperous cooperation and setting a new course for sustainable green development with cutting-edge technologies. It also demonstrated acceptance and support for the cooperation framework from both the public and private sectors of Thailand and China.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070651T5HC26","origin_url":"https://www.bangkokpost.com/thailand/pr/2897988/bdms-wellness-clinic-introduces-1-million-baht-longevity-card-for-optimal-health","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/b546e0ec-db23-4517-acd6-257f50f83749","title":"BDMS Wellness Clinic Introduces 1 Million Baht Longevity Card for Optimal Health","description":"BDMS Wellness Clinic, a leading preventive healthcare center, introduces the Longevity Card  —an exquisite privilege designed to help individuals transcend traditional health care limits through the Wellness Life Blueprint, a sustainable roadmap to  optimal  health. This  privilege  card offers comprehensive health assessments, providing insights into micronutrient balance, sleep quality, weight management, mental health support, personalized exercise planning, and lifestyle medicine for enhanced  healthspan . Supported by BDMS Wellness Clinic ’ s dedicated team of preventive medicine specialists, the Longevity Card ensures personalized care for every client. Valued at over 1.5 million THB, the card includes meticulously curated benefits to  enrich  your wellness journey. This launch marks a significant step in positioning Thailand as a Wellness Destination of the World .","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110706515J2IAF","origin_url":"https://www.bangkokpost.com/thailand/pr/2897986/uob-and-gowabi-co-host-a-seminar-to-support-beauty-wellness-businesses","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/dbd159e8-8091-4cee-bf3b-b0374ccf887f","title":"UOB and GoWabi co-host a seminar to support Beauty & Wellness businesses","description":"UOB Thailand, in collaboration with GoWabi, the online platform for beauty and wellness deals, has organised the \"Passion to Success\" seminar for beauty and wellness SMEs. Held at the UOB Plaza headquarters, this event aimed to facilitate knowledge sharing and present financial solutions for businesses seeking to enhance their competitive edge.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110704511VW279","origin_url":"https://www.bangkokpost.com/thailand/pr/2897913/over-1-500-runners-join-vietjets-eco-friendly-charity-run","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/7a604d19-0461-4fa1-b3e8-3e4afcbb00c2","title":"Over 1,500 Runners Join Vietjet's Eco-Friendly Charity Run","description":"Over 1,500 runners participated in the ","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070422UO551A","origin_url":"https://www.bangkokpost.com/thailand/pr/2897927/rimowa-unveils-limited-edition-optical-cabin-suitcase","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241107/c1_2897927_700.jpg","title":"RIMOWA Unveils Limited-Edition Optical Cabin Suitcase","description":"First introduced in 1950, grooves quickly became a defining feature of RIMOWA’s identity. Inspired by the golden age of aviation, the design went on to become one of the brand’s most recognisable hallmarks. Now, in a remarkable evolution, these emblematic grooves transform in a bold new direction with the introduction of a new limited-edition release: The RIMOWA Original Cabin Optical.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070422DIRN5U","origin_url":"https://www.bangkokpost.com/thailand/pr/2897302/when-is-the-best-time-to-invest-in-cryptocurrency-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/8d98688d-f5d9-4151-9cac-0c6622539625","title":"When is the Best Time to Invest in Cryptocurrency?","description":"Investing in cryptocurrency can be both an opportunity and a risk, with price swings and conflicting information coming from all directions. How do you know if now is the time to invest? This guide will go through some of the key signs and strategies to make that decision, especially if you’re looking to get in with popular assets like Bitcoin.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070406ZRMCC1","origin_url":"https://www.bangkokpost.com/thailand/pr/2897923/ichitan-x-mackcha-inspiring-eco-friendly-packaging-revolution","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/79cf73c9-abb9-4db5-8e91-0d2ca6ec1829","title":"Ichitan x Mackcha: Inspiring Eco-Friendly Packaging Revolution","description":"Did you know that only 10% of plastic is recycled, while the remaining 90% accumulates in landfills, harming the environment and exacerbating greenhouse gas emissions and climate change? To address this, Ichitan Group has launched a new product under the concept ","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070402OO8HND","origin_url":"https://www.bangkokpost.com/thailand/pr/2897897/get-that-glow-girls-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/045b7202-7c37-4da3-b3d5-4d08b00957bc","title":"Get That Glow, Girls!","description":"Discover rejuvenation and smooth, brighter skin at Chi, The Spa, Shangri-La Bangkok with a selection of luxurious body scrubs. Choose from Natural Sea Salt, Turmeric with Rice, Fruity Creamy, or Green Tea for an invigorating 45-minute treatment priced at THB 1,800 nett per adult. Available daily from 10am to 10pm until 20 December 2024, guests can also enjoy a 15% discount on any continuing body massage of 60 minutes or more.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411070132W2QCRP","origin_url":"https://www.bangkokpost.com/thailand/pr/2896458/bangkok-life-assurances-new-vision-the-most-caring-insurance-brand","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896458_700.jpg","title":"Bangkok Life Assurance’s New Vision: “The Most Caring Insurance Brand”","description":"Bangkok Life Assurance Public Limited Company has unveiled a renewed vision grounded in “Caring,” launching a brand campaign to become “The Most Caring Insurance Brand” and drive sustainable growth. Mr. Chone Sophonpanich, President and CEO, emphasised that “Caring” has long been a cornerstone of the company’s mission, shaping its life and health insurance products, the BLA Every Care programme, and interactions with clients, agents, and financial advisors. Customer insights reveal that “Caring” is the top attribute associated with the Bangkok Life brand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411061037OXD825","origin_url":"https://www.bangkokpost.com/thailand/pr/2897323/phuket-emerges-as-global-luxury-lifestyle-hub-for-investors","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/09f8c086-c38c-415c-8338-5e16e16c269a","title":"Phuket Emerges as Global Luxury Lifestyle Hub for Investors","description":"Phuket has undergone a remarkable transformation in recent years. Fringed by the Andaman Sea, this tropical oasis has evolved from a popular beach resort destination into one of the world’s most sought-after luxury residential markets, attracting elite consumer brands, Michelin-star dining, and international-standard education and medical care.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241106103740K9TL","origin_url":"https://www.bangkokpost.com/thailand/pr/2897331/bitkub-group-lights-up-thailand-with-nationwide-billboard-spectacle-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e680ca75-d483-420d-b743-544fcc3f6449","title":"Bitkub Group Lights Up Thailand with Nationwide Billboard Spectacle!","description":"Bitkub Capital Group Holdings is making waves again by launching billboard advertisements nationwide to celebrate and welcome developers, researchers, and blockchain technology enthusiasts from around the world attending the  7th Devcon conference. Titled \"DEVCON Southeast Asia\" and organised by the Ethereum Foundation, this annual gathering of Ethereum network developers takes place in Thailand from November 12-15, 2024, at Queen Sirikit National Convention Center in Bangkok.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110610371QAHUK","origin_url":"https://www.bangkokpost.com/thailand/pr/2897338/skyview-bangkok-reopens-silver-lining-lounge-for-exclusive-events","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/01f5735d-c8b8-48cc-bb29-24c37c91c0d8","title":"Skyview Bangkok Reopens Silver Lining Lounge for Exclusive Events","description":"Skyview Hotel Bangkok proudly unveils the grand reopening of its newly renovated Silver Lining Lounge, an exclusive venue designed for high-end business and social events in Bangkok’s bustling city centre.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411061017X5LOFA","origin_url":"https://www.bangkokpost.com/thailand/pr/2897303/alive-by-aia-launches-be-the-best-version-campaign","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241106/c1_2897303_700.jpg","title":"ALive by AIA Launches ‘Be the Best Version’ Campaign","description":"ALive Powered by AIA, the one-stop health and wellness application, has launched the “Be the Best Version of Yourself with ALive” campaign. This initiative aims to inspire individuals at every stage of life, bringing smiles and joy through activities that empower them to become better versions of themselves each day.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSN56992.json"}