{"data":[{"code":"ART2412110651SFOJSE","origin_url":"https://www.bangkokpost.com/thailand/pr/2917926/capstone-asset-launches-peylaa-phuket-luxury-redefined","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241211/c1_2917926_700.png","title":"Capstone Asset Launches Peylaa Phuket: Luxury Redefined","description":"Capstone Asset Co., Ltd. has unveiled Peylaa Phuket Bang Tao, a THB 3.4 billion luxury condominium project in the iconic Bang Tao neighbourhood. Known for its vibrant lifestyle and world-class attractions, Bang Tao is home to this new development designed to offer a refined living experience. Located near popular destinations like Boat Avenue, golf courses, international schools, and shopping malls, Peylaa Phuket is poised to become a sought-after address for discerning buyers.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241211065188XX0J","origin_url":"https://www.bangkokpost.com/thailand/pr/2917921/sansiri-unveils-the-society-embracing-phukets-soft-power-on-the-global-stage","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241211/c1_2917921_700.png","title":"Sansiri Unveils \"The Society\": Embracing Phukets Soft Power On The Global Stage","description":"SANSIRI PHUKET + THE SOCIETY brings new vibrant energy to Phuket with the launch of “The Society”, highlighting local soft power through art, cultural heritage, beach sports, kite surfing, cuisine and sustainable practices, writes Atiya Achakulwisut.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412110406NTLM20","origin_url":"https://www.bangkokpost.com/thailand/pr/2917846/bosch-supports-thailands-ev-progress-at-teba-panel","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241211/c1_2917846_700.jpg","title":"Bosch Supports Thailand’s EV Progress at TEBA Panel","description":"Dubbed “Southeast Asia’s EV Pioneer,” Thailand’s electric vehicle (EV) market has made significant strides over the years, achieving a six percent growth in the first 10 months of 2024, despite a global slowdown in EV adoption.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412110351XIGS8Z","origin_url":"https://www.bangkokpost.com/thailand/pr/2916551/proud-real-estate-unveils-all-is-well-vision","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916551_241209165406_700.jpg","title":"PROUD REAL ESTATE Unveils ‘ALL IS WELL’ Vision","description":"PROUD REAL ESTATE  a leading developer in the luxury real estate sector, is revolutionising the Thai property landscape with its visionary \"ALL IS WELL\" concept. Delivering Holistic, Sustainable Living Solutions. Discover an Elevated Living Experience through World-Class Designs that Prioritise Residents’ Well-Being and Environmental Harmony, Comprehensive Amenities for Ultimate Relaxation, Personalised Services for Residents, and Eco-Friendly Lifestyles. Announcing plans for 2025, PROUD will launch three new projects across Bangkok suburbs, Hua Hin, and Phuket, valued at 9.2 billion baht, setting a revenue target of 10 billion baht, achieving exponential growth. Reaffirm  ESG commitments  by transforming projects and operations towards sustainability. Aim for Net Zero emissions by 2050, while continuously improving community well-being and enhancing business potential to meet the criteria of the THAI ESG fund in the future.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241211000290EQ3X","origin_url":"https://www.bangkokpost.com/thailand/pr/2916576/pearson-btec-in-thai-language-launching-a-new-era-in-international-education","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916576_700.png","title":"Pearson Btec In Thai Language: Launching A New Era In International Education","description":"BANGKOK, THAILAND, 11 DECEMBER, 2024:   Pearson (LON: PSON) , the world’s leading learning company, today launched BTEC in Thai language, increasing access to the Thai Ministry of Education endorsed qualification helping develop Thailand’s skilled workforce.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412101036ERLACS","origin_url":"https://www.bangkokpost.com/thailand/pr/2917327/20-years-on-thailand-advances-disaster-resilience-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241210/c1_2917327_700.jpg","title":"20 Years On: Thailand Advances Disaster Resilience ","description":"General His Serene Highness Prince Chalermsuk Yugala Graces “Remembering the 20th Year of the 2004 Indian Ocean Earthquake and Tsunami in Thailand, Reflections for Advancing Disaster Management through Higher Education-Industry Partnerships” Forum at AIT","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24121009428LDMJJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2917305/once-wongamat-pattayas-tallest-sustainable-luxury-haven-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241210/c1_2917305_241210153516_700.jpg","title":"Once Wongamat: Pattaya's Tallest Sustainable Luxury Haven ","description":"Honour Group, a leading real estate developer headquartered in Pattaya, has officially launched “Once Wongamat,” a landmark luxury condominium project in North Pattaya under the concept “Reserve the Rarest, Deserve the Finest.” The project blends world-class elegance with sustainability, aiming to redefine premium residences and investment opportunities in Thailand’s premier coastal destination, with a target to sell all 548 units by early 2029.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241210080215I5DA","origin_url":"https://www.bangkokpost.com/thailand/pr/2917295/mitr-phol-wins-human-rights-award-for-5th-year","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241210/c1_2917295_700.jpg","title":"Mitr Phol Wins Human Rights Award for 5th Year","description":"Mitr Phol Group, a global leader in sustainability within the food products industry, has been honoured with the prestigious \"Human Rights Award 2024\" for the fifth consecutive year. The award was presented by the Rights and Liberties Protection Department, Ministry of Justice, at a ceremony held at the Miracle Grand Convention Hotel, Bangkok, on 2 December 2024. Representing the company, Mr Kitjapat Trakulmaykee, Executive Vice President of the Human Resources Group, received the accolade from Pol. Col. Tawee Sodsong, Minister of Justice.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412100752MZNXYK","origin_url":"https://www.bangkokpost.com/thailand/pr/2917286/iconsiam-welcomes-2025-with-global-countdown-spectacle-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241210/c1_2917286_700.jpg","title":"ICONSIAM Welcomes 2025 with Global Countdown Spectacle ","description":"ICONSIAM is gearing up to host the  Amazing Thailand Countdown 2025 , a three-day extravaganza that promises to be a world-class celebration like no other. From December 29 to 31, 2024, over 60 celebrities will take the stage, delivering unforgettable performances that blend Thai cultural brilliance with global entertainment excellence.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241210075204TRPB","origin_url":"https://www.bangkokpost.com/thailand/pr/2912630/orient-showcases-made-in-thailand-success-at-epson-factory","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241202/c1_2912630_700.png","title":"Orient Showcases 'Made in Thailand' Success at EPSON Factory","description":"Showcasing the perfect blend of Japanese precision and Thai craftsmanship, Orient celebrated the success of its \"Made in Thailand\" initiative with a special event at the EPSON Thailand (EPTH) factory in Chachoengsao province on November 28, 2024. The gathering brought together key executives, media representatives, and partners to highlight Thailand’s pivotal role in the brand’s global watch production under the Orient and Orient Star banners.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412100336V2IBJ2","origin_url":"https://www.bangkokpost.com/thailand/pr/2916647/vasmo-to-set-up-chemical-metal-compound-plant","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916647_700.png","title":"VASMO to set up Chemical Metal Compound plant","description":"GC Estate Co., Ltd. (GC Estate), a subsidiary of GC Group specialising in utilities and land leasing and sales has signed a land lease agreement for a 60-rai plot in the Asia Industrial Estate, Rayong province, with VASMO Co., Ltd. (VASMO). The agreement facilitates the construction of Thailand’s first chemical metal compound and alloy manufacturing plant utilising decommissioned and unused catalysts from the oil refining and petrochemical industries.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412090952VM97NI","origin_url":"https://www.bangkokpost.com/thailand/pr/2916641/green-fund-propels-saraburis-low-carbon-cement-model-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916641_700.jpg","title":"Green Fund Propels Saraburi’s Low-Carbon Cement Model ","description":"The Thai Cement Manufacturers Association (TCMA), in collaboration with the Thai and Canadian governments, UNIDO, and the Global Cement and Concrete Association (GCCA), has launched the ‘SARABURI SANDBOX,’ a groundbreaking low-carbon pilot project to advance sustainability in the cement and concrete industry. Supported by a green fund from Environment and Climate Change Canada (ECCC), this initiative is Thailand’s first regional prototype for reducing carbon emissions in its largest cement production hub.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24120909527LKFH8","origin_url":"https://www.bangkokpost.com/thailand/pr/2916582/toavh-restructures-with-primus-group-to-drive-growth","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916582_700.png","title":"TOAVH Restructures with Primus Group to Drive Growth","description":"TOA Venture Holding Co ., Ltd. (TOAVH) has announced a major organisational restructuring, appointing Primus Group to oversee its auto dealership business, which represents seven major brands. This move aims to enhance operational efficiency and competitiveness.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24120909475V55EO","origin_url":"https://www.bangkokpost.com/thailand/pr/2916637/bangkoktellink-mvno-empowers-disadvantaged-groups-with-free-online-access-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916637_700.jpg","title":"Bangkoktellink (MVNO) Empowers Disadvantaged Groups with Free Online Access ","description":"Bangkoktellink (MVNO), a mobile network operator with a commitment to social impact, has partnered with three of Thailand’s leading government agencies to provide free internet access for disadvantaged groups, promoting online learning and self-development.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412090832A9YE67","origin_url":"https://www.bangkokpost.com/thailand/pr/2916601/youth-unite-to-inspire-and-support-society","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916601_700.png","title":"Youth Unite to Inspire and Support Society","description":"In a heartfelt display of youthful compassion, talented young performers from across Thailand are coming together for the charity performance Aladdin 2024. Scheduled for Sunday, 15th December 2024, at Chiang Mai University Convention Centre, the production aims to raise funds for underprivileged and orphaned youth.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412090406Q95KOK","origin_url":"https://www.bangkokpost.com/thailand/pr/2916480/celebrate-the-season-at-moxy-bangkok-ratchaprasong","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241209/c1_2916480_700.jpg","title":"Celebrate the Season at Moxy Bangkok Ratchaprasong","description":"Ring in the festive season at Moxy Bangkok Ratchaprasong, the first and largest Moxy hotel in Asia-Pacific, nestled in Bangkok’s lively shopping district. With exclusive Christmas and New Year’s Eve events, along with exciting weekend activities and seasonal promotions, Moxy is the perfect destination for a celebration filled with fun, flavour, and entertainment.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24120903364X93MF","origin_url":"https://www.bangkokpost.com/thailand/pr/2907011/river-city-bangkok-celebrates-40-years-of-artistic-excellence","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241122/c1_2907011_241206135512_700.png","title":"River City Bangkok Celebrates 40 Years of Artistic Excellence","description":"With a storied history that has shaped Thailand’s art scene and elevated it to global prominence,  River City Bangkok  celebrated its 40th anniversary on December 3, 2024, with the grand event  “40 Years of Magnificent Art and Antiques.”  The occasion highlighted the enduring achievements of this iconic centre for art and culture, a gateway that has tirelessly championed and supported artistic excellence.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412061222L4JTIA","origin_url":"https://www.bangkokpost.com/thailand/pr/2915331/eternal-bloom-260-rose-varieties-at-siam-paragon","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915331_700.png","title":"Eternal Bloom: 260 Rose Varieties at Siam Paragon","description":"Discover the beauty of 260 rose varieties at “Eternal Bloom: The Silk Rose Garden” from today until 15 December 2024 at Parc Paragon, Siam Paragon.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412061002SZAR54","origin_url":"https://www.bangkokpost.com/thailand/pr/2915201/phillip-securities-acquires-rhb-securities-in-landmark-deal","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915201_700.png","title":"Phillip Securities Acquires RHB Securities in Landmark Deal","description":"Phillip Securities (Thailand) Public Company Limited (PhillipCapital Thailand) has solidified its position as a leading player in Thailand’s securities industry through a strategic acquisition of RHB Securities (Thailand) Public Company Limited. This transformative merger is set to double Phillip Securities’ market share, with trading value surpassing  200 billion baht,  while driving revenue growth by over  50%.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412060932XG1LAC","origin_url":"https://www.bangkokpost.com/thailand/pr/2915220/connectxs-ai-solutions-redefine-customer-experience-for-brands","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915220_700.jpg","title":"ConnectX’s AI Solutions Redefine Customer Experience for Brands","description":"As customer expectations evolve, ConnectX, a leading innovator in customer experience technology, is transforming how brands interact with consumers through its state-of-the-art AI platform. Unveiled at the recent  “Unlocking AI: Elevate Customer Experience”  event, the platform offers brands a seamless way to convert leads into loyal customers and enhance retention with personalised, real-time interactions.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412060917ZG5KOT","origin_url":"https://www.bangkokpost.com/thailand/pr/2914732/thailand-to-become-ai-hub-with-cp-true-idc-siam-ai-partnership-via-nvidia-tech","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241205/c1_2914732_700.jpg","title":"Thailand to Become AI Hub with CP-True IDC & SIAM.AI Partnership via NVIDIA Tech","description":"Thailand is positioning itself as a regional leader in artificial intelligence (AI) innovation through a strategic partnership between  True Internet Data Center (True IDC),  a subsidiary of  Charoen Pokphand Group (CP),  and  Siam AI Corporation (SIAM.AI CLOUD),  Thailand’s first  NVIDIA Cloud Partner.  This landmark collaboration, sealed with a Memorandum of Understanding (MOU), aims to advance Thailand’s digital infrastructure, foster AI development, and drive global competitiveness in the emerging AI economy.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241206072159EP02","origin_url":"https://www.bangkokpost.com/thailand/pr/2915162/r-x-reinforces-leadership-in-health-via-rxlife-at-sustainability-forum-2025","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915162_700.png","title":"R.X. reinforces leadership in health via RXLIFE at Sustainability Forum 2025","description":"R.X. Group,  a leading distributor of pharmaceuticals and medical devices, shared its vision for sustainable management that has driven its success over the past  50 years. By addressing environmental, economic, and social dimensions, the company has established itself as a leader in delivering health and quality of life, guided by the principle of  “Good Health & Well-Being”   which emphasizes the importance of physical, mental, and spiritual well-being as the foundation for a sustainable future  at Sustainability Forum 2025: Synergizing for Driving Business on December 3–4, 2024, at Paragon Hall, 5th floor, Siam Paragon.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412060652F6CSXL","origin_url":"https://www.bangkokpost.com/thailand/pr/2915146/street-artists-transform-moxy-hotel-into-creative-paradise","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915146_700.png","title":"Street Artists Transform Moxy Hotel into Creative Paradise","description":"In a bold move to enliven Bangkok","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412060526XSSL4G","origin_url":"https://www.bangkokpost.com/thailand/pr/2914080/phukets-culinary-gems-sustainability-meets-gastronomic-excellence","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241204/c1_2914080_700.png","title":"Phuket’s Culinary Gems: Sustainability Meets Gastronomic Excellence","description":"The culinary scene at the InterContinental Phuket Resort offers a captivating journey into gastronomy through its signature fine dining venues, Hom and Jaras. These celebrated restaurants not only tantalise the taste buds but also champion sustainability, setting a benchmark for Phuket’s dining experiences.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2412060357LB8CMR","origin_url":"https://www.bangkokpost.com/thailand/pr/2914016/haadthip-celebrates-55-years-with-sustainable-growth","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241204/c1_2914016_241204151854_700.png","title":"HaadThip Celebrates 55 Years with Sustainable Growth","description":"HaadThip Public Company Limited (HTC), the exclusive bottling partner of The Coca-Cola Company in Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24120603511NOG7J","origin_url":"https://www.bangkokpost.com/thailand/pr/2915090/t3-partners-with-viettel-to-transform-vietnams-smart-homes","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241206/c1_2915090_700.png","title":"T3 Partners with Viettel to Transform Vietnam’s Smart Homes","description":"Bangkok, December 6 — T3 Technology, Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSA8PFWB.json"}