{"data":[{"code":"ART2411050732OHDMRJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2896373/pepsico-giz-project-builds-climate-resilience-in-thai-agriculture","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241105/c1_2896373_700.jpg","title":"PepsiCo-GIZ Project Builds Climate Resilience in Thai Agriculture","description":"Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH, PepsiCo Services Asia Limited and Pepsi Cola (Thai) Trading as well as governmental partners and local communities announced their joint achievement in implementing the Building a Climate Resilient Potato Supply Chain Through a Whole-Farm Approach (RePSC) project, leading to a strengthened public private partnership and livelihoods and capacity development among thousands of farmers particularly the female groups in Chiang Mai and Chiang Rai.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050706T60NJN","origin_url":"https://www.bangkokpost.com/thailand/pr/2896383/irpc-and-ptt-support-khung-bang-kachao-with-hdpe-pipes","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/3b68a301-f861-4be2-8eb7-73b1cb724431","title":"IRPC and PTT Support Khung Bang Kachao with HDPE Pipes","description":"IRPC Public Co., Ltd. (IRPC), led by Chanida Sanhakorn, Senior Manager of Corporate Branding & Communication, and Komkrit Phewthong, Manager of PTT Reforestation, received a 100-metre HDPE pipeline from Nattabhumi Laosathirawong, Plant Manager of Thai-Asia P.E. Pipe Co., Ltd., a leading Thai manufacturer of advanced HDPE piping systems.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050637PR9KVD","origin_url":"https://www.bangkokpost.com/thailand/pr/2896382/pwa-first-elevating-water-services-and-organisational-excellence","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/7b1c9f85-d103-4262-982d-5f2897bffc62","title":"PWA First: Elevating Water Services and Organisational Excellence","description":"The Provincial Waterworks Authority (PWA) has unveiled its 2025 policy and operational roadmap, \"PWA First,\" aimed at driving organisational excellence across all facets of water utility services while aligning with national and Ministry of Interior directives. The announcement was made on November 4, 2025, at PWA Headquarters in the Prapawiwat Building.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050451PIC6QF","origin_url":"https://www.bangkokpost.com/thailand/pr/2896337/thaioil-wins-set-award-for-sustainability-excellence-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/4c384e28-bf20-40b9-a4e5-5e3970860443","title":"Thaioil Wins SET Award for Sustainability Excellence 2024","description":"Thai Oil Public Company Limited (Thaioil), represented by Miss Korapat Limpaphayom, Vice President – Group Company Secretary and Sustainability, recently received the Sustainability Excellence Award in the Commended Sustainability subcategory at the SET Awards 2024. The award was presented by Professor Emeritus Kittipong Urapipatanapong, Chairman of the Board of Directors of the Stock Exchange of Thailand (SET), during the SET Awards 2024 ceremony, jointly organised by the Stock Exchange of Thailand and Money & Banking Magazine at the Professor Sangvien Indaravijaya Auditorium on the 7th floor of the SET building.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411050131M34805","origin_url":"https://www.bangkokpost.com/thailand/pr/2895797/ericsson-shaping-the-future-of-connectivity-in-thailand","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/544cf56c-03db-48f1-86d3-1b3f74d2c76f","title":"Ericsson: Shaping the Future of Connectivity in Thailand","description":"As Thailand stands at the cusp of a digital revolution, the potential of 5G technology to reshape industries, bolster the economy, and elevate society as a whole has never been more evident. With a rich 118-year legacy in the country, Ericsson Thailand is proud to be leading this wave of transformation with 5G. Based on its world-class expertise in 5G, Ericsson is playing a pivotal role in driving digitalisation and empowering Thailand to unlock the full potential of its digital economy. It is supporting Thailand’s journey to become a digital economy and emerge as a leading digital hub in Southeast Asia.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041051CE3GHV","origin_url":"https://www.bangkokpost.com/thailand/pr/2895807/bitkub-summit-2024-showcases-investment-and-tech-for-a-sustainable-future","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/82d032ae-b58d-4db1-a8ef-e92809398731","title":"BITKUB SUMMIT 2024 Showcases Investment and Tech for a Sustainable Future","description":"Bitkub Capital Group Holdings Co., Ltd., Thailand’s leader in blockchain technology and digital assets, organised the national seminar BITKUB SUMMIT 2024 under the theme Gateway to the Future: Opening the Door to Technology and Investment for a Sustainable Future. The event shared insights on investment, technology, and entrepreneurship from over 60 leading national speakers, including politicians, business leaders, investors, and public figures. Held from 19–20 October 2024 at the Plenary Hall, Queen Sirikit National Convention Center in Bangkok, it featured 20 stages and numerous activities, with a total value exceeding 3 million baht.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041022G4ZZO2","origin_url":"https://www.bangkokpost.com/thailand/pr/2895786/loréal-celebrates-115-years-by-honouring-thai-women-scientists","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/13298eb2-f4ec-4219-b65f-86c5b9597fdb","title":"L'Oréal Celebrates 115 Years by Honouring Thai Women Scientists","description":"From left to right: Asst. Prof. Dr. Waleeporn Donphai from the Department of Chemical Engineering, Faculty of Engineering, Kasetsart University, who received the grant in the field of Physical Sciences; Assoc. Prof. Dr. Anyanee Kamkaew from the School of Science, Suranaree University of Technology, awarded in the field of Life Sciences; and Dr. Pongkarn Chakthranont from the National Nanotechnology Center, National Science and Technology Development Agency (NSTDA), awarded in the field of Physical Sciences.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041007XEQC5B","origin_url":"https://www.bangkokpost.com/thailand/pr/2895611/dbs-secures-the-best-kindergarten-title-at-theasianparent-awards-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/74d13dca-85a8-4fb0-aec5-68fc331fe673","title":"DBS Secures The Best Kindergarten Title at theAsianparent Awards 2024","description":"In a landmark achievement,   DBS Denla British School   has been crowned   Parents’ Choice Best Kindergarten   at the prestigious   theAsianparent Awards 2024  . This recognition, presented at a grand ceremony held on October 29th, 2024, at Synergy Hall, Energy Complex, Bangkok, underscores DBS’s reputation as the leading choice for early childhood education in Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411041007VM3SQ5","origin_url":"https://www.bangkokpost.com/thailand/pr/2895791/unicef-and-partners-advocate-extended-paid-parental-leave","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/1ab9b162-acaf-44b3-8905-ab2794c0ced3","title":"UNICEF and Partners Advocate Extended Paid Parental Leave","description":"To encourage workplaces in Thailand to adopt stronger family-friendly policies, UNICEF, the Embassy of Sweden, and UN Global Compact Network Thailand (UNGCNT) organised a thought leadership conference titled “Supporting Working Parents with Paid Parental Leave: Status, Sharing Experiences, and Next Steps”. The event brought together stakeholders including businesses and government representatives to discuss the positive impact of paid parental leave on both businesses and families, particularly the importance of family-friendly policies for child development.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110408374F6PFY","origin_url":"https://www.bangkokpost.com/thailand/pr/2895747/tds-electronics-launches-new-appliances-and-welcomes-distributors","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/aa3e9e84-bcb3-4f29-9bb4-208c078862c0","title":"TDS Electronics Launches New Appliances and Welcomes Distributors","description":"TDS Electronics (Thailand) has unveiled a new line-up of innovative kitchen appliances designed to enhance daily life in households. This collection, featuring premium juicers, coffee makers, and grinders, combines advanced functionality with sleek design, adding a sophisticated edge to kitchen essentials. The driving philosophy behind TDS Electronics is captured in its brand ethos, The Deluxe Style (TDS), reflecting the company’s commitment to crafting appliances that cater to Thai consumers","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040732VTZ2NK","origin_url":"https://www.bangkokpost.com/thailand/pr/2895717/celebrate-new-year-with-artisans-at-mbk-centers-gift-to-give-6","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e6916cf0-3b1f-4e25-9d4c-e3647efbd7ef","title":"Celebrate New Year with Artisans at MBK Center’s Gift to Give #6","description":"MBK Centre invites you to celebrate the joyful New Year season with shopping from vulnerable artisans at the Gift to Give #6 Perfect Gifts Charity Festival, in collaboration with the Department of Women","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040721KN1F3N","origin_url":"https://www.bangkokpost.com/thailand/pr/2895628/decoding-the-success-of-lyn-around-everywhere-campaign","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/cb28f782-df75-4b88-862b-4ad3f7949e29","title":"Decoding the success of ‘Lyn Around Everywhere’ campaign","description":"Lyn Around, one of the top five brands under the Jaspal Group banner, has become a key influence in young women’s lifestyle and fashion choices thanks to its “Lyn Around Everywhere” campaign. The impact this campaign has had on the Thai fashion scene was recently recognised with the “Best Fashion Influencer Campaign Award” handed out at the Thailand Influencer Awards 2024.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040653Z9I4BS","origin_url":"https://www.bangkokpost.com/thailand/pr/2895671/navigating-thailands-renewable-energy-landscape-insights-from-apac","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/5386bd62-5080-4d2d-9086-16b49c90fd11","title":"Navigating Thailand’s Renewable Energy Landscape: Insights From APAC","description":"Renewable energy is a pivotal force in the global energy transition, particularly in the Asia-Pacific (APAC) region, and Thailand has a valuable role to play.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040653QZRPJF","origin_url":"https://www.bangkokpost.com/thailand/pr/2895698/dragonfly-h-e-a-l-summit-concludes-with-bali-retreat-launch","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/abc3c0d9-279d-4154-9ded-4a036f23731f","title":"Dragonfly H.E.A.L. Summit Concludes with Bali Retreat Launch","description":"The Dragonfly H.E.A.L. (Harmony, Empathy, Acceptance, Love) Summit 2024 concluded after two days in Bangkok, engaging over 2,000 attendees with renowned speakers, immersive experiences, and networking opportunities.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040508R16M4Y","origin_url":"https://www.bangkokpost.com/thailand/pr/2895643/irpc-recognised-for-innovation-and-sustainability-at-set-awards-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241104/c1_2895643_700.jpg","title":"IRPC Recognised for Innovation and Sustainability at SET Awards 2024","description":"IRPC IRPC Public Co., Ltd. (IRPC), led by Terdkiat Prommool, President and Chief Executive Officer, received the Business Excellence Award in the Best Innovative Company category for its phthalate-free PP innovation. Presented by Asadej Kongsiri, Director of the Stock Exchange of Thailand, at the 2024 SET Awards event, this accolade recognises IRPC’s commitment to impactful innovations that contribute positively to the economy and society, focusing on commercially viable solutions developed over the past three years.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411040317KU89OF","origin_url":"https://www.bangkokpost.com/thailand/pr/2895593/thailands-first-all-laser-dts-cinema-opens-in-yala","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/6c3f1fd8-8361-4d9e-b913-3ba3c1d56704","title":"Thailand's First All-Laser DTS Cinema Opens in Yala","description":"SF Corporation Public Company Limited, Thailand’s premier cinema chain, has launched the country","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411011207NOCQR8","origin_url":"https://www.bangkokpost.com/thailand/pr/2894411/jetts-fitness-opens-50th-club-at-one-bangkok","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241101/c1_2894411_700.png","title":"Jetts Fitness Opens 50th Club at One Bangkok","description":"\"Jetts Fitness celebrates a major milestone with the grand opening of its 50th branch at One Bangkok,\" announced Mike Lamb, CEO of Jetts Fitness Thailand. \"Recognised nationwide for its vast network, Jetts now boasts five premium Jetts Black locations, including The PARQ Rama IV, Gaysorn Village, Central Westville, and Park Silom, with the newest gem situated in One Bangkok. This flagship club offers 24/7 access, even on holidays, and includes virtual classes, exclusive equipment, a functional training zone, and a playground—all designed for an exceptional fitness experience. The Fuel Bar by Grain Thailand completes the offering with healthy meals, snacks, and drinks under one roof.\"","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411011141Y81AX2","origin_url":"https://www.bangkokpost.com/thailand/pr/2894397/poland-celebrates-national-day-in-thailand-with-luxury-yacht-showcase","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241101/c1_2894397_700.png","title":"Poland Celebrates National Day in Thailand with Luxury Yacht Showcase","description":"The Embassy of the Republic of Poland and the Polish Investment and Trade Agency in Thailand marked Poland’s National Day on November 11, 2024, with a grand celebration at the Shangri-La Hotel in Bangkok. This year’s event featured an impressive highlight: the display of a luxury yacht from Poland, underscoring the strong connection between Poland and Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411011046Z7Y6VC","origin_url":"https://www.bangkokpost.com/thailand/pr/2894377/robinson-lifestyle-invests-2-5-billion-baht-to-redefine-retail","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241101/c1_2894377_700.jpg","title":"Robinson Lifestyle Invests 2.5 Billion Baht to Redefine Retail","description":"Robinson Lifestyle, under Central Retail, announces 2.5 Billion Baht Investment to Transform Shopping Center and Expand New Branches, Enhancing Experiences for Customers, Partners, and Communities","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010852GGJLST","origin_url":"https://www.bangkokpost.com/thailand/pr/2891476/paradise-found-family-adventures-on-phukets-private-island","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241028/c1_2891476_700.jpg","title":"Paradise Found: Family Adventures on Phuket's Private Island","description":"Unveiling a hidden gem on a secluded island off Phuket’s east coast,    The Naka Island,   a   Luxury Collection Resort & Spa   , invites global explorers to immerse themselves in exceptional, indigenous experiences paired with the personalized service synonymous with our brand. Guests begin their journey at the tranquil Lobby Lounge, where a seamless check-in service prepares them for their upcoming adventure. This serene retreat, with its calming interiors and thoughtful amenities, sets the tone for the unique escape that awaits, followed by a brief speedboat ride from Phuket. ","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010703U33J7A","origin_url":"https://www.bangkokpost.com/thailand/pr/2894297/medpark-celebrates-4th-anniversary-with-rock-concert-in-the-park","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241101/c1_2894297_700.jpg","title":"MedPark Celebrates 4th Anniversary with Rock Concert in the Park","description":"MedPark Hospital has announced the return of its popular “MedMusic in the Park” event for the third year, a key community initiative celebrating its 4th anniversary with festive cheer. At a recent press conference, Dr Pongpat Patanavanich, Managing Director of MedPark Hospital, expressed gratitude for the public’s trust and confidence, particularly from the communities of Sukhumvit, Silom, Sathorn, the expatriate community in Thailand, and its patients. \"MedMusic in the Park\" aims to give back by promoting physical and mental well-being through the uplifting power of music, the universal language of humanity, while also marking the upcoming Christmas and New Year festivities. Dr Patanavanich extended special thanks to supporting organisations, particularly the Bangkok Metropolitan Administration (BMA), which has generously provided space for the event over the past three years. MedPark is excited to step into its fifth year as a leading hospital in Thailand and Southeast Asia, with plans to enhance its services for complex diseases, invest in advanced medical innovations, and launch the Genotech Lab Centre in the coming year.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010652OYGG6N","origin_url":"https://www.bangkokpost.com/thailand/pr/2893646/the-embassy-of-switzerland-in-thailand-and-novartis-hosted-cardio-catalyst-forum","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241031/c1_2893646_700.jpg","title":"The Embassy of Switzerland in Thailand and Novartis hosted Cardio Catalyst Forum","description":"Bangkok, Thailand – The Embassy of Switzerland in Thailand, led by Mr. Pedro Zwahlen, the Ambassador of Switzerland to Thailand, Cambodia, and Lao PDR, along with Novartis (Thailand) Limited, hosted the second forum under the theme Cardio Catalyst: Driving Change in Heart Health, reaffirming the commitment to improving the quality of cardiovascular care and promoting the health and well-being of Thai citizens. The event was honoured by the presence of H.E. Somsak Thepsuthin, Minister of Public Health of Thailand, and Kevin Zou, Head of the Asia Aspiring Cluster at Novartis International, at the Residence of the Swiss Ambassador.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010652MMRQ0Z","origin_url":"https://www.bangkokpost.com/thailand/pr/2892982/brighton-college-bangkok-named-british-international-school-of-the-year","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241030/c1_2892982_700.jpg","title":"Brighton College Bangkok named British International School of the Year","description":"Brighton College Bangkok has won one of the most prestigious global awards in international education, being named  British International School   of the Year  at the  Independent Schools of the Year Awards  2024. This award recognises excellence in academic results, teaching and learning; significant contributions to sustainability, community engagement and global citizenship; strong leadership, governance, and strategic vision for continued growth and success; and exceptional co-curricular opportunities that enrich the pupil experience.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010652GC2T73","origin_url":"https://www.bangkokpost.com/thailand/pr/2893683/mars-marks-25-years-of-pet-food-excellence-in-thailand","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241031/c1_2893683_241101101957_700.jpg","title":"Mars Marks 25 Years of Pet Food Excellence in Thailand","description":"Mars, Incorporated, a global leader in pet care products and services, confectionery, snacking, and food, and the maker of some of the world’s most-loved brands, proudly announces the 25th anniversary of its Mars Petcare Pak Chong factory, the manufacturer of PEDIGREE®, WHISKAS®, IAMS®, CESAR®, SHEBA®, TEMPTATIONS™, NUTRO™, KAL KAN®, OPTIMUM™, and KITE KAT®. This significant milestone marks a journey of growth and innovation, establishing the Pak Chong factory as the largest Mars facility in Asia.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010652FVBYKF","origin_url":"https://www.bangkokpost.com/thailand/pr/2894217/bangchak-achieves-18th-year-of-5-star-governance-excellence","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241101/c1_2894217_700.jpg","title":"Bangchak Achieves 18th Year of 5-Star Governance Excellence","description":"Bangchak Corporation Public Company Limited has been awarded an “Excellent” five-star rating in the Corporate Governance Report of Thai Listed Companies (CGR) 2024 for the 18th consecutive year in the Energy and Utilities business category, under the Resources Industry group. The assessment was conducted by the Thai Institute of Directors Association (IOD) with support from The Stock Exchange of Thailand and The Securities and Exchange Commission (SEC), with over 800 listed companies evaluated.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411010652EKHDMR","origin_url":"https://www.bangkokpost.com/thailand/pr/2893766/wow-summit-2024-taking-place-on-11-12-november-in-bangkok","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241031/c1_2893766_700.jpg","title":"WOW Summit 2024 Taking Place on 11-12 November in Bangkok","description":"This November, Bangkok will act as the global hub of tech innovation with the highly-anticipated WOW Summit 2024 taking place in the city. The event will be held on November 11-12, at the Emsphere-UOB LIVE venue.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110106524DCSL2","origin_url":"https://www.bangkokpost.com/thailand/pr/2893667/hylife-launches-innovation-excellence-awards-2024-in-chiang-mai","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241031/c1_2893667_241031162056_700.jpg","title":"Hylife Launches 'Innovation Excellence Awards 2024' in Chiang Mai","description":"Hylife Group, under the leadership of CEO Mr. Shubhodeep Das and in partnership with Chiang Mai Municipality, the Agricultural and Food Technology Science Park (MAP), the Economic Innovation Network, and the Centre of Excellence in Agricultural Innovation for Entrepreneurial Graduates at Maejo University (Agri Inno), has launched the “INNOVATION DRIVEN ENTERPRISE for Sustainability in Chiang Mai” project. This initiative seeks to advance innovation in food and hygiene products, promoting sustainable regional development.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24110106523BQHDF","origin_url":"https://www.bangkokpost.com/thailand/pr/2891593/osstem-thailands-symposium-showcases-modern-implant-innovations","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241028/c1_2891593_700.jpg","title":"Osstem Thailand’s Symposium Showcases Modern Implant Innovations","description":"Osstem  Thailand will host the   Bangkok  Osstem  Implant Symposium   on 29 November 2024 at the Marriott Hotel Sukhumvit, Bangkok, under the theme   “Simplicity Meets Innovation: Modern Implant Solutions.”   This event will delve into the fusion of  cutting-edge  dental technology and streamlined procedures, providing a vital platform to  showcase  the latest implant industry trends and share practical clinical experiences in applying advanced technology to patient care.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSLAST.json"}