{"data":[{"code":"ART2411290916PACJC9","origin_url":"https://www.bangkokpost.com/thailand/pr/2911182/experience-taiwans-culinary-treasures-at-taiwan-select-lounge-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911182_700.jpg","title":"Experience Taiwan’s Culinary Treasures at TAIWAN SELECT Lounge ","description":"The TAIWAN SELECT LOUNGE at Taiwan Expo 2024, hosted by Taiwan’s Ministry of Economic Affairs (MOEA), showcases Taiwan’s rich culinary heritage and regional flavours. Located at Booth No. 547 in Hall 5 of the Queen Sirikit National Convention Centre, the Lounge features a selection of specialities from Taiwan’s diverse regions, offering visitors an opportunity to explore the country’s culture through cherished foods such as pineapple cakes, oolong tea, mochi, and more.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290916OA0SGU","origin_url":"https://www.bangkokpost.com/thailand/pr/2911186/thai-wah-and-fuji-nihon-unite-for-agri-food-innovation-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/359a6fcf-e425-41b6-8ed0-89c4923076d5","title":"Thai Wah and Fuji Nihon Unite for Agri-Food Innovation ","description":"Thai Wah Public Company Limited (TWPC), a leader in the agri-food industry, has partnered with Japan’s Fuji Nihon Corporation (FNC) to form a strategic joint venture. This collaboration will focus on the manufacturing, sales, and distribution of tapioca starch and related products, cementing their positions as innovators in the food ingredients sector.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112908222IWP4N","origin_url":"https://www.bangkokpost.com/thailand/pr/2911175/discover-global-flavours-at-the-mall-food-expo","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/464a5e6a-9751-48f0-bd53-682d8315336f","title":"Discover Global Flavours at The Mall Food Expo","description":"The Mall Lifestore, in collaboration with the Ministry of Commerce, the Rice Department, the Ministry of Agriculture and Cooperatives, Thai Life Insurance Public Company Limited, and Thai Namthip Corporation Limited, presents “The Mall Lifestore Food Expo” under the theme “The Rice Journey.” This unique event showcases international culinary creations using rice varieties from around the world, complemented by special dishes crafted by Thailand’s top chefs and a rice innovation exhibition by the Rice Department.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290802G3AS7D","origin_url":"https://www.bangkokpost.com/thailand/pr/2911160/irpc-hosts-deputy-pm-at-rayong-oil-refinery-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/a77dd1cf-0f71-49e3-a4e9-74f85d0f00be","title":"IRPC Hosts Deputy PM at Rayong Oil Refinery ","description":"Pirapan Salirathavibhaga, Deputy Prime Minister and Minister of Energy, along with Sarawut Kaewtathip, Director-General of the Department of Energy Business, and Triphob Wongtrirat, Governor of Rayong, were warmly welcomed by Lersak Thongruang, Senior Executive Vice President of Operations, and Wanida Utaisomnapa, Senior Executive Vice President of Corporate Commercial and Marketing, during a visit to IRPC’s oil refinery in Rayong.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290721E94TP9","origin_url":"https://www.bangkokpost.com/thailand/pr/2911082/nt-showcases-digital-solutions-at-digitech-asean-2024-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911082_700.jpg","title":"NT Showcases Digital Solutions at DigiTech ASEAN 2024 ","description":"National Telecom Public Company Limited (NT) is committed to advancing the technology and digital industry by offering a comprehensive range of digital solutions designed to meet the diverse needs of businesses. The company participated in  DigiTech ASEAN Thailand 2024,  an ASEAN technology and digital exhibition and seminar held from  20–22 November 2024 at Hall 6, IMPACT Exhibition and Convention Centre,  Muang Thong Thani. The event facilitated industry and business sectors in addressing challenges associated with digital transformation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290657CSFN8V","origin_url":"https://www.bangkokpost.com/thailand/pr/2911137/baxter-wins-amcham-awards-for-sustainability-in-dialysis","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911137_700.png","title":"Baxter Wins AMCHAM Awards for Sustainability in Dialysis","description":"The American Chamber of Commerce (AMCHAM) has recognised Baxter Kidney Care (Vantive) for its Green Nephrology Project and the new Jom Recycle project that reduce plastic waste from dialysis.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290651QXPBCO","origin_url":"https://www.bangkokpost.com/thailand/pr/2911125/iconcraft-spreads-festive-joy-with-meaningful-gift-collection","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911125_700.jpg","title":"ICONCRAFT Spreads Festive Joy with Meaningful Gift Collection","description":"ICONCRAFT, a space dedicated to Thai creative handicrafts, is adding heartfelt meaning to every gift this season through its collaboration with Artstory by Autistic Thai. Together, they have launched the “ICONCRAFT x Artstory Miracle of Gifts 2024” collection, a special range of products themed “A brooklet of fish and the sunlight on ripened grain, an abundance of nature.” Designed by talented Thai autistic children, this collection showcases their artistic skills and creativity.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290556XBDDNP","origin_url":"https://www.bangkokpost.com/thailand/pr/2911106/generali-and-undp-are-building-msme-resilience-in-thailand","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911106_700.png","title":"Generali and UNDP are building MSME resilience in Thailand","description":"Generali Thailand and the United Nations Development Programme (UNDP) have announced a collaboration, building upon a global partnership, to support the growth and sustainability of Micro, Small, and Medium Enterprises (MSME) in Thailand. The initiative aims to enhance MSMEs, which are crucial to the country’s economic structure, and help them prepare for future challenges. The partnership begins with developing an MSME Social Protection Framework, a risk assessment tool designed to improve readiness and raise awareness of the risks facing entrepreneurs’ while providing strategies to mitigate them. This includes narrowing the protection gap for business operators through insurance solutions designed to strengthen business stability and sustainability.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290521WCCDA7","origin_url":"https://www.bangkokpost.com/thailand/pr/2911077/boncafe-thailand-route-to-root-season-3-beyond-the-beans","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911077_700.jpg","title":"Boncafe Thailand Route to Root Season 3: Beyond the Beans","description":"Boncafe (Thailand) Co., Ltd. hosted the Boncafe Route to Root activity under the concept “Beyond the Beans” for its valued customers. The trip took place from 25–27 November 2024 at the coffee plantation, Na Thep Sadet Garden in Thep Sadet, Doi Saket District, Chiang Mai Province. Now in its third year, this event aimed to provide customers with an in-depth understanding of the coffee production process from upstream to downstream.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290407YBWPZI","origin_url":"https://www.bangkokpost.com/thailand/pr/2911067/one-good-habit-sparks-change-at-taiwan-excellence-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911067_700.jpg","title":"One Good Habit Sparks Change at Taiwan Excellence ","description":"The  \"One Good Habit, Love the Earth\" campaign  by  Taiwan Excellence  has successfully concluded, engaging over  1,300 participants  in a shared mission to adopt sustainable habits and take meaningful steps toward a greener planet. Combining online and onsite activities, the campaign demonstrated how small, impactful actions can collectively lead to significant change for the environment.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290407WM981Y","origin_url":"https://www.bangkokpost.com/thailand/pr/2911075/tidlor-posts-10-profit-growth-npl-at-1-88-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911075_700.jpg","title":"TIDLOR Posts 10% Profit Growth, NPL at 1.88%","description":"Ngern Tid Lor Public Company Limited (TIDLOR) reported robust operational results for the first three quarters of 2024, with a net profit of 3.186 billion baht, marking a 10.3% year-on-year (YoY) growth. Total revenues increased by 19.5% (YoY), attributed to higher interest income from credit loan business expansion, strategic adjustments in net interest margin, and continued growth in fee and service income from the insurance brokerage business.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290332YHUS7V","origin_url":"https://www.bangkokpost.com/thailand/pr/2911046/sikhio-smart-living-redefining-thailands-smart-city-future","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241129/c1_2911046_700.jpg","title":"Sikhio Smart Living: Redefining Thailand's Smart City Future","description":"The Ministry of Digital Economy and Society (MDES) and the Digital Economy Promotion Agency (depa) have showcased the achievements of the SIKHIO SMART LIVING project, which has transformed Sikhio into a fully-fledged smart city. The initiative focuses on enhancing safety, public service delivery, and urban data management, aiming to improve the efficiency of services and city management for citizens, society, and local communities.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290106O8IKFY","origin_url":"https://www.bangkokpost.com/thailand/pr/2909877/top-5-best-hotels-staycation-in-bangkok","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241127/c1_2909877_700.png","title":"Top 5 Best Hotels Staycation in Bangkok","description":"Looking for a break from your routine without the hassle of traveling far? A staycation in Bangkok offers the perfect blend of luxury, relaxation, and excitement, right in the heart of Thailand’s vibrant capital. In this blog, we’ve rounded up the 5 best hotels for a memorable  staycation in Bangkok  that will let you recharge, and enjoy a mini-vacation close to home!","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411290007NNXXXA","origin_url":"https://www.bangkokpost.com/thailand/pr/2909216/how-xms-trading-bonus-can-help-elevate-your-trading-game","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241126/c1_2909216_700.jpg","title":"How XM’s Trading Bonus Can Help Elevate Your Trading Game","description":"Have you been monitoring the fluctuations in gold prices this year? If you","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241128130209URAG","origin_url":"https://www.bangkokpost.com/thailand/pr/2910666/phyathai-paolo-and-krungsri-partner-for-seamless-asean-healthcare","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/110e0fa0-92a5-4843-9819-2ece467ec442","title":"Phyathai-Paolo and Krungsri Partner for Seamless ASEAN Healthcare","description":"Phyathai-Paolo Hospital Group led by  Mr. Paiboon Fuengfuskul  (third from right), Chief Financial Officer, and  Dr. Anantasak Apairatana  (second from right), Chief Medical Officer, jointly signed a memorandum of understanding (MOU) with Krungsri (Bank of Ayudhya PCL) led by  Mr. Pairote Cheunkrut  (third from left), Chief Strategy Officer, and  Miss Pathatai Kulachan  (second from left), Head of ASEAN Business Group, with an aim to create fully integrated healthcare experience through innovative medical technology in combination with financial service for customers in the ASEAN region, especially those from Cambodia in the initial phase, so as to meet the needs for health services in the digital era in a comprehensive way.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411281006MTHGS7","origin_url":"https://www.bangkokpost.com/thailand/pr/2910627/banyan-tree-residences-sichon-and-uob-host-exclusive-clara-evening","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241128/c1_2910627_700.jpg","title":"Banyan Tree Residences Sichon and UOB Host Exclusive Clara Evening","description":"Banyan Tree Residences Sichon, the first luxury branded residence in Nakhon Si Thammarat, recently hosted an exclusive evening reception at Bangkok’s renowned Clara Restaurant. In partnership with UOB Privilege Bank, the event welcomed a select group of high-net-worth individuals and distinguished guests for an unforgettable evening of fine dining, live music, and insightful presentations.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411281002VCQ7H4","origin_url":"https://www.bangkokpost.com/thailand/pr/2910620/true-corporation-champions-tech-for-good-with-bold-innovations-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241128/c1_2910620_700.jpg","title":"True Corporation Champions “Tech for Good” with Bold Innovations ","description":"In an era of rapid global change, societies face increasingly complex challenges influenced by diverse factors. In Thailand, social issues such as the rising number of missing persons among elderly individuals with Alzheimer’s disease are becoming more pressing. In 2022, approximately 770,000 elderly individuals were reported to have dementia. Vulnerable groups, including over 300,000 individuals with autism, further highlight the need for tailored solutions. Additionally, human-wildlife conflicts, particularly involving wild elephants, have impacted over 156,066 households annually, causing damage to agricultural land, injuries, and fatalities.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280851ABR7EQ","origin_url":"https://www.bangkokpost.com/thailand/pr/2910605/c-p-group-alerts-public-to-fraudulent-scams","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241128/c1_2910605_700.png","title":"C.P. Group Alerts Public to Fraudulent Scams","description":"C.P. Group has issued a statement regarding fraudulent activities currently circulating on social media. Scammers are using the name and image of Mr. Dhanin Chearavanont, Senior Chairman of C.P. Group, in fabricated news articles and advertisements that appear to be credible content from reputable media outlets. These deceptive materials are designed to lure the public into participating in fake investment schemes by promising high returns.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280836XN12BW","origin_url":"https://www.bangkokpost.com/thailand/pr/2910592/smart-solutions-empower-thai-agriculture-for-a-sustainable-future","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/4bbc02e8-baf2-4770-87b2-6a2c5cac5795","title":"Smart Solutions Empower Thai Agriculture for a Sustainable Future","description":"Agriculture is a key profession for the Thai people, and Thailand is one of the world","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280752GWOLDJ","origin_url":"https://www.bangkokpost.com/thailand/pr/2910566/rewear-recare-transforming-textile-waste-into-timeless-fashion","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241128/c1_2910566_700.png","title":"ReWear ReCare: Transforming Textile Waste into Timeless Fashion","description":"The partnership of three leading Thai brands—PT, Circular, and Yuedpao—introduces the ReWear ReCare collection, a groundbreaking sustainable fashion initiative. This collaboration transforms textile waste into modern lifestyle pieces, creating a circular economy that reduces environmental impact.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280422LDQ9EU","origin_url":"https://www.bangkokpost.com/thailand/pr/2910455/whoscall-sweeps-nine-awards-at-adpeople-awards-2024-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241128/c1_2910455_700.jpg","title":"Whoscall Sweeps Nine Awards at AdPeople Awards 2024 ","description":"Whoscall, a leading anti-scam application, and its creative partners, SOUR Bangkok and Dentsu Creative Thailand, triumphed at the AdPeople Awards and Symposium 2024, securing nine top awards for their innovative campaigns. The campaigns included the hit single ‘ ตัดสาย’ (Hang Up) and the radio spot ‘เบอร์อัปมงคล’ (Unlucky Number), which combine music, technology, and entertainment to raise scam awareness and drive behavioural change across Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280351IFX58Z","origin_url":"https://www.bangkokpost.com/thailand/pr/2909900/mill-hill-international-school-thailand-a-gateway-to-boundless-learning-opportunities","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/56ed5b1b-0289-4b33-9b62-745b8feca6d5","title":"Mill Hill International School Thailand: A Gateway to Boundless Learning Opportunities","description":"Mill Hill International School Thailand is set to become a beacon of educational excellence in Chiang Mai, offering parents a unique option for their children","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411280002L7365M","origin_url":"https://www.bangkokpost.com/thailand/pr/2909212/trade-the-news-a-powerful-strategy-to-try-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241126/c1_2909212_700.jpg","title":"Trade the News: A Powerful Strategy to Try?","description":"When it comes to investing, the common advice is to focus on long-term fundamentals and avoid getting caught up in short-term price fluctuations. However, for traders looking to seize short-term opportunities, news trading offers a dynamic and potentially profitable strategy. “Trading the news” allows traders to capitalize on price swings triggered by significant events. While this strategy presents high reward potential, it also carries notable risks. In this article, we will explore what news trading is, its advantages and disadvantages, the types of news that tend to influence markets, and tips on managing risks associated with this fast-paced approach.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112712020VQIIY","origin_url":"https://www.bangkokpost.com/thailand/pr/2909840/nt-highlights-role-as-asean-digital-hub-at-telecoms-world-asia-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241127/c1_2909840_700.png","title":"NT Highlights Role as ASEAN Digital Hub at TELECOMS WORLD ASIA 2024","description":"National Telecom Public Company Limited (NT) participated in TELECOMS WORLD ASIA 2024, reaffirming its position as a leading telecommunications provider in Thailand and the ASEAN Digital Hub. With robust telecommunications infrastructure and stable international network connections, NT demonstrated its readiness to support the region’s digital economy. The convention took place from 19–20 November 2024 at the Convention Centre, 22nd floor, Centara Grand Hotel at CentralWorld, Bangkok.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART241127110254QMEW","origin_url":"https://www.bangkokpost.com/thailand/pr/2909922/litefinance-joins-leicester-city-as-official-partner","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241127/c1_2909922_700.jpg","title":"LiteFinance Joins Leicester City as Official Partner","description":"We are excited to announce  that LiteFinance  has entered into a multi-year partnership with Premier League football club Leicester City as their Official Trading Partner. This collaboration marks a significant milestone for LiteFinance as we expand our presence in the world of sports, aligning our brand with one of England’s most admired football clubs.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24112711023ZQ05X","origin_url":"https://www.bangkokpost.com/thailand/pr/2909912/unlocking-the-secrets-of-internet-security-for-everyday-users","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241127/c1_2909912_700.png","title":"Unlocking the Secrets of Internet Security for Everyday Users","description":"Our reliance on the Internet for communication, work, entertainment, and shopping is undeniable. However, this convenience brings with it significant security risks. For everyday users, understanding how to protect their online presence is more important than ever. In this guide, we will unlock the secrets of internet security and provide you with essential tips and tools to stay safe online.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONSJ95WM7.json"}