{"data":[{"code":"ART2410310851UL0XCD","origin_url":"https://www.bangkokpost.com//thailand/pr/2893663/irpc-and-pttlng-sign-mou-on-carbon-material-innovation","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/9ca399ff-e8a7-4cb6-abe0-4e8e98088c9d","title":"IRPC and PTTLNG Sign MOU on Carbon Material Innovation","description":"IRPC Public Co., Ltd., led by President and CEO Kris Imsang (2nd from left), and PTTLNG Co., Ltd., represented by Acting President Rattikool Piyavongwanich (2nd from right), signed a Memorandum of Understanding (MoU) to drive research and development for commercialising carbon materials in the petrochemical industry. This partnership includes the exchange of academic knowledge, research insights, and technical expertise. The MoU signing was witnessed by Anucha Somjitchob, Executive Vice President at the IRPC Innovation Center, and Somchai Ramart, Executive Vice President of Engineering and Maintenance at PTTLNG Co., Ltd., at Suanson Room, Energy Complex Building B.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2410310851MS9CC0","origin_url":"https://www.bangkokpost.com//thailand/pr/2893571/irpc-honoured-for-excellence-in-greenhouse-gas-management","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/90a7ccee-0ac9-480b-8870-5d6e7576d63e","title":"IRPC Honoured for Excellence in Greenhouse Gas Management","description":"IRPC Public Co., Ltd., under the leadership of President and CEO Kris Imsang, has been awarded a certificate of honour as a 2024 Climate Action Leading Organisation (CALO), recognising its outstanding role in greenhouse gas management. Presented by Jatuporn Buruspat, Permanent Secretary of the Ministry of Natural Resources and Environment, this award places IRPC among 23 organisations in Thailand acknowledged for high standards in greenhouse gas reduction, with IRPC attaining a gold-level rating for emission measurement and reduction, and a bronze level for greenhouse gas compensation.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2410310851LZ6ELS","origin_url":"https://www.bangkokpost.com//thailand/pr/2893556/bangchak-honoured-with-three-prestigious-set-awards-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/5615b592-2265-4a45-9a7f-4b7e043be9d1","title":"Bangchak Honoured with Three Prestigious SET Awards 2024","description":"Bangchak Corporation Public Company Limited received three SET Awards 2024 for listed companies, earning top honours in two categories: Sustainability Excellence – Best Sustainability Award and Business Excellence – Best Investor Relations Award. The awards were presented by Professor Emeritus Kitipong Urapeepatanapong, Chairperson of The Stock Exchange of Thailand (SET), and Mr. Asadej Kongsiri, President of SET, at the SET Awards 2024 Ceremony, jointly organised by The Stock Exchange of Thailand and Money & Banking magazine, at the Stock Exchange of Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2410310851FPGKUQ","origin_url":"https://www.bangkokpost.com//thailand/pr/2893096/thai-consumer-spending-shifts-experiences-and-investments-soar","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/6dbe1ece-ee0b-463f-adcb-cc658faf24d7","title":"Thai Consumer Spending Shifts: Experiences and Investments Soar","description":"Over two in five Thai consumers (42 per cent) are spending more on essentials, while younger Thais show a shift towards experiential spending, findings from UOB’s latest ASEAN Consumer Sentiment Study (ACSS) indicate.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2410310851CK8OK0","origin_url":"https://www.bangkokpost.com//thailand/pr/2893587/mgallery-montazure-reaches-topping-off-milestone-in-phuket","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/2f73bbb1-3eec-4753-8c6c-7ca43559fbd6","title":"MGallery MontAzure Reaches Topping-Off Milestone in Phuket","description":"MGallery Residences MontAzure, a freehold lakeside condominium and Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2410310851AOEJOW","origin_url":"https://www.bangkokpost.com//thailand/pr/2893581/irpc-wins-second-runner-up-at-2024-weps-awards","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/27c34667-2dfe-4b37-8a4f-e18666d83d8f","title":"IRPC Wins Second Runner-up at 2024 WEPs Awards","description":"IRPC Public Co., Ltd., represented by Vitarn Jindamai, Vice President of IRPC Industrial Zone, Corporate Social Responsibility and Community, received the second runner-up award at the 2024 Women’s Empowerment Principles (WEPs) Awards, hosted by UN Women. The award was given in the category of promoting gender equality through community activities and industrial engagement. The recognition highlights the company’s initiatives aimed at empowering elderly people in Rayong Province, particularly elderly women, by equipping them with skills to generate income and contribute sustainably to society.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24103108515EVXT7","origin_url":"https://www.bangkokpost.com//thailand/pr/2893562/insights-into-thai-moms-online-shopping-behaviour","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/a49df893-c04c-4b7a-89dd-edda4f412063","title":"Insights into Thai Moms’ Online Shopping Behaviour","description":"While product quality and price are the primary factors that win brand loyalty from Thai moms—up to 79% are loyal to a brand because of these factors—service quality is the real game-changer. It’s a key driver that could cause them to abandon a brand. Only 36% of moms will stick with a brand if they receive satisfactory service, but if the service is disappointing, 43% of loyal moms are ready to “converse” with other brands.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24103108513OIA6T","origin_url":"https://www.bangkokpost.com//thailand/pr/2893608/rml-and-euro-creations-unveil-poltrona-frau-experience","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241031/c1_2893608_700.jpg","title":"RML and Euro Creations Unveil Poltrona Frau Experience","description":"RML (Raimon Land Public Company Limited), a leader in luxury and ultra-luxury real estate development in Thailand, has partnered with Euro Creations, a premier provider of luxury furniture and lifestyle products, to introduce the iconic Italian brand, Poltrona Frau, through the ‘Exclusive Unveiling of the Poltrona Frau Bangkok’. The event marked the opening of the new Monobrand Store of Poltrona Frau, imported by Euro Creations, located on Thonglor Soi 5. RML","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24103108510B7DZG","origin_url":"https://www.bangkokpost.com//thailand/pr/2893543/thailand-advances-digital-transformation-with-huawei-cloud-stack-partnership","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/3a922782-e9c6-4996-94b1-e543ec6460dc","title":"Thailand Advances Digital Transformation with Huawei Cloud Stack Partnership","description":"Huawei Cloud Stack provides innovative technology and cloud-enabled government services to propel Thailand towards becoming a regional cloud hub.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":null}