{"data":[{"code":"ART2411191051IMSOTQ","origin_url":"https://www.bangkokpost.com/thailand/pr/2904858/will-the-thai-baht-decline-further-in-2024-","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/62fc5bc6-e763-481e-8ca0-f2fdc4fee5e5","title":"Will the Thai Baht Decline Further in 2024?","description":"In the lead-up to the US election, the Baht rose steadily throughout 2024 but saw a significant shift at the end of September. It has since dropped by 7% and appears likely to continue depreciating. So, what happened?","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191036UV2S8R","origin_url":"https://www.bangkokpost.com/thailand/pr/2904787/onesiam-superapp-elevates-shopping-with-exclusive-member-rewards","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/47be2048-c767-4a0a-ab9d-0858de9f4838","title":"ONESIAM SuperApp Elevates Shopping with Exclusive Member Rewards","description":"ONESIAM SuperApp advances its smart platform transformation, elevating a universe of extraordinary experiences to new heights. It’s now set to deliver unparalleled privileges for valued customers of prestigious global projects. Siam Paragon, Siam Center, Siam Discovery, ICONSIAM, ICS, and Siam Premium Outlets Bangkok are joining forces with leading partners across diverse industries, including premium and luxury brands within the world-class premium business ecosystem. Together, they are creating unparalleled privileges and valuable experiences exclusively for ONESIAM members.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191026UKV83W","origin_url":"https://www.bangkokpost.com/thailand/pr/2904902/the-grand-return-of-pattaya-international-jazz-festival-2024","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/9288883f-5346-4e91-9ebd-a3789fec113b","title":"The Grand Return of “Pattaya International Jazz Festival 2024”","description":"“Pattaya City” is set to host the grand-scale “Pattaya International Jazz Festival 2024” under the theme “The Harmonic Jazz & Beach.” This event will feature a free concert by world-renowned jazz artist Ronan Keating alongside numerous international and Thai jazz musicians, aiming to elevate Pattaya City to global prominence. The event is scheduled to take place on December 6 – 7, 2024, from 5:00 PM to midnight at Pattaya Beach, Chonburi.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411191002LMQEC4","origin_url":"https://www.bangkokpost.com/thailand/pr/2904887/c-p-group-partners-with-zhejiang-university-to-drive-innovation","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904887_700.jpg","title":"C.P. Group Partners with Zhejiang University to Drive Innovation","description":"C.P. Group and Zhejiang University have joined forces to advance human capital development, innovation, and research across multiple disciplines, supporting global efforts to achieve a sustainable future.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111908213TC28O","origin_url":"https://www.bangkokpost.com/thailand/pr/2904843/sweden-leads-waste-management-inspiring-thailands-e-waste-future","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904843_700.png","title":"Sweden Leads Waste Management, Inspiring Thailand’s e-Waste Future","description":"Sweden stands as one of the world’s most efficient nations in waste management, driven by the principle that \"there is no such thing as waste, only resources out of place.\" This philosophy has been fully embraced through comprehensive policies, legislation, and collaboration across all sectors of society, transforming Sweden into a nation that is nearly free of waste.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411190806ZZWDC8","origin_url":"https://www.bangkokpost.com/thailand/pr/2904832/irpc-and-ptt-group-build-an-organisation-of-good-and-talented-people-at-ptt-group-cg-day-2024","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904832_700.jpg","title":"IRPC and PTT Group Build an Organisation of “Good and Talented People” at PTT Group CG Day 2024","description":"On November 6, 2024, Mr. Terdkiat Prommool, President and Chief Executive Officer; Asst. Prof. Dr. Chaiyaporn Puprasert, Chairman of the Corporate Governance and Sustainability Committee; Mr. Komol Buaket, Member of the Corporate Governance and Sustainability Committee; and Dr. Buranin Rattanasombat, Member of the Risk Management Committee, IRPC Public Co., Ltd., and Chief New Business and Sustainability Officer, PTT Public Co., Ltd., together with executives and employees of IRPC and the PTT Group, united in promoting business driven by corporate governance principles at the 16  th  PTT Group CG Day 2024. The event, themed “CG Citizen Sustainability Connect: Open, Link, and Transparent,” emphasised conducting business in accordance with good governance principles (CG) to adapt to modern changes while balancing the interests of all stakeholders.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411190756C2TUZ1","origin_url":"https://www.bangkokpost.com/thailand/pr/2904822/thailand-data-centers-surge-as-ai-meets-green-goals","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/ec4afe1f-c4d3-455c-981b-cd472f224b39","title":"Thailand Data Centers Surge as AI Meets Green Goals","description":"Thailand","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111904513JAC7I","origin_url":"https://www.bangkokpost.com/thailand/pr/2904738/dow-powers-ev-sustainability-with-high-performance-silicones","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241119/c1_2904738_241119113857_700.jpg","title":"Dow Powers EV Sustainability with High-Performance Silicones","description":"Dow, a global leader in materials science and silicone production, is at the forefront of advancing cutting-edge material technology solutions to drive the sustainable development of the burgeoning electric vehicle (EV) sector in Southeast Asia. This investment in innovation is not just a strategic move but also a commitment to shaping a greener and more sustainable mobility future.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411190422FUADGC","origin_url":"https://www.bangkokpost.com/thailand/pr/2904718/asean-carbon-associations-unite-for-regional-climate-action","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/15e22e5f-9013-44b9-8ad8-b17d675cef6c","title":"ASEAN Carbon Associations Unite for Regional Climate Action","description":"Five major carbon market associations from Thailand, Malaysia, Indonesia, Singapore, and ASEAN signed a Memorandum of Collaboration ( MoC ) at the 29th Conference of the Parties (COP29) in Baku, Azerbaijan. This collaboration supports the development of the ASEAN Common Carbon Framework (AACF), which aims to  establish  standards and guidelines for carbon credit trading in the region, ensuring transparency and efficiency in fostering a low-carbon society.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411190302IYY5UM","origin_url":"https://www.bangkokpost.com/thailand/pr/2904216/blue-by-alain-ducasse-celebrates-five-years-in-style","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/a7de7006-70d5-41f4-8ba9-40a33842b75b","title":"Blue by Alain Ducasse Celebrates Five Years in Style","description":"Bangkok, November 2024 –Michelin-starred French fine-dining destination Blue by Alain Ducasse marks its fifth anniversary with an exceptional culinary event destined to be unforgettable. On Saturday, November 23, 2024 , the iconic restaurant will host an exclusive four-hand collaboration, bringing together Chef Wilfrid Hocquet, Executive Chef of Blue by Alain Ducasse, and the visionary Chef Joris Rousseau, the mastermind behind Feuille in Hong Kong.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411181027TO10LG","origin_url":"https://www.bangkokpost.com/thailand/pr/2904168/unlocking-large-language-models-a-guide-for-leaders","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/bdf3fbdb-0993-4907-b16b-3188190e92d7","title":"Unlocking Large Language Models: A Guide for Leaders","description":"Imagine a world where computers understand only human language but can also create and communicate nearly as effectively as humans. This is not just a daydream; it","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411181027473KDD","origin_url":"https://www.bangkokpost.com/thailand/pr/2904242/minor-international-tops-thailand-in-times-global-ranking","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/5bd075ac-8f47-452f-8b1f-2e24679b24ee","title":"Minor International Tops Thailand in TIME’s Global Ranking","description":"Minor International Public Company Limited (MINT)    has been recogni s ed in the “World’s Best Companies 2024” by TIME magazine and Statista, the world-leading statistics portal and industry ranking provider. The prestigious recognition places Minor International at #425 out of 1,000 companies worldwide and ranks it as the #1 company in Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180936O3KE2Q","origin_url":"https://www.bangkokpost.com/thailand/pr/2902771/thanis-yaovapongaree-elevating-premium-real-estate-in-phuket","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/1ca89ddb-f10f-4383-ba6b-8083913a25a3","title":"Thanis Yaovapongaree: Elevating Premium Real Estate in Phuket","description":"Mr Thanis Yaovapongaree began his career as a General Manager at CPF before fully committing to the real estate industry. He initially focused on developing rental apartments in Bangkok, including The Grand Mansion, City View, and 20 Boutique in the Lat Krabang and Huai Khwang areas. These projects not only provided steady income but also established a solid foundation for his real estate business, with a combined value of over 3 billion THB in apartment and condominium projects.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180906RTDIYB","origin_url":"https://www.bangkokpost.com/thailand/pr/2904207/tcma-champions-green-energy-transition-with-collaborative-action","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904207_700.jpg","title":"TCMA Champions Green Energy Transition with Collaborative Action","description":"The   Thai Cement Manufacturers Association (TCMA)   is urging the government to accelerate the green energy transition by addressing legal and regulatory barriers,  facilitating  green funding, and promoting collaborative efforts under its   3C concept  :   Collaborative Mindset, Collaborative Action, and Collaborative Value  .","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111808373QPD21","origin_url":"https://www.bangkokpost.com/thailand/pr/2904193/bitkubs-moodeang-shines-in-times-square-spotlight","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/67710db4-29e0-474e-8dd7-e2fdfc9d7acf","title":"Bitkub’s Moodeang Shines in Times Square Spotlight","description":"Bitkub Group has once again made waves on social media. Jirayut (Topp) Srupsrisopa, Founder and Group CEO of Bitkub Capital Group Holdings, Thailand’s leading digital asset and blockchain company, introduced the world to Moodeang, the beloved baby pygmy hippo adored by fans globally. Moodeang appeared on a vibrant animated display in New York’s Times Square, extending an invitation to people worldwide to visit Thailand.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180722YHJLX8","origin_url":"https://www.bangkokpost.com/thailand/pr/2904171/tatler-best-of-asia-takeover-series","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904171_700.jpg","title":"Tatler Best of Asia Takeover Series","description":"Get ready for an exclusive celebration of Asia’s finest culinary and mixology talent as the  Tatler Best of Asia Takeover Series  arrives in Bangkok from 22 to 26 November. Part of the prestigious  Tatler Best  initiative, this five-day event will bring together the region’s top chefs and bartenders for a series of unique pop-up experiences, exclusively available through Mastercard’s  Priceless.com  Tatler Experience page.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180722M0Q1MO","origin_url":"https://www.bangkokpost.com/thailand/pr/2904121/lixils-vision-2050-pioneering-zero-carbon-and-circular-living-","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904121_241118133028_700.png","title":"LIXIL's Vision 2050: Pioneering Zero Carbon and Circular Living ","description":"The environment and sustainability     are pressing global issues, encompassing climate change-related risks such as heatwaves, torrential rains, and rising sea levels. In 2015, the world united under the   Paris Agreement  , pledging to limit the global temperature rise to below 1.5°C above pre-industrial levels. The   Glasgow Climate Pact     of 2021 underscored that this figure is not merely aspirational but a critical global goal.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180706LSSB85","origin_url":"https://www.bangkokpost.com/thailand/pr/2904162/master-partners-with-lumeo-health-for-regional-expansion","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904162_700.jpg","title":"MASTER Partners with Lumeo Health for Regional Expansion","description":"Master Style PCL (\"MASTER\") is setting its sights on becoming Southeast Asia","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180702RA1MQN","origin_url":"https://www.bangkokpost.com/thailand/pr/2904148/king-power-launches-the-power-of-funtastic-celebration-2025","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904148_700.jpg","title":"King Power Launches “The Power of Funtastic Celebration 2025","description":"King Power, Thailand’s leader in travel retail, in collaboration with Kasikornbank, proudly launches its year-end campaign,  “The Power of Funtastic Celebration 2025”  — a festival of happiness, endless fun, and new possibilities. This unique Thai-inspired Christmas celebration highlights Thailand’s rich culture through four captivating themes: Thai-Sud-Feaw, Thai-Sud-Jarb, Thai-Sud-Fin, and Thai-Sud-Fun. Visitors can enjoy mesmerising art installations, live performances, and exclusive promotions at King Power Rangnam from now until 31 December 2024.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180647M7ARKX","origin_url":"https://www.bangkokpost.com/thailand/pr/2904131/uob-and-mitr-phol-partner-for-sustainable-growth","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904131_700.jpg","title":"UOB and Mitr Phol Partner for Sustainable Growth","description":"UOB Thailand has extended a   THB 1.5 billion sustainability-linked loan (SLL)   to Mitr Phol Sugar Corp Ltd, the world’s fourth-largest sugar producer, to support its working capital needs while advancing its sustainability agenda.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART24111806472KH3QW","origin_url":"https://www.bangkokpost.com/thailand/pr/2904137/savour-thanksgiving-with-anantara-siams-gourmet-feasts","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/2644f087-a4e1-4d81-9340-a00d40c6b591","title":"Savour Thanksgiving with Anantara Siam’s Gourmet Feasts","description":"Make this Thanksgiving truly special with a delicious gourmet takeaway from Anantara Siam Bangkok Hotel, where culinary excellence meets the spirit of the season. Whether you","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180452WWT3ED","origin_url":"https://www.bangkokpost.com/thailand/pr/2904086/zte-showcases-cutting-edge-solutions-at-thailand-convention","site_code":"TH01","url":null,"image":"https://static.bangkokpost.com/media/content/20241118/c1_2904086_700.jpg","title":"ZTE Showcases Cutting-Edge Solutions at Thailand Convention","description":"ZTE Corporation (0763.HK / 000063.SZ), a global leader in integrated information and communication technology solutions, took  centre  stage as the platinum sponsor at the  W.Media  Thailand Cloud & Datacenter Convention 2024. At the event, ZTE  showcased  its comprehensive intelligent computing solutions, including IDC full lifecycle services and innovative technologies. The company introduced a liquid cooling-based data  centre  solution designed to address key challenges and build efficient, scalable, and sustainable data  centres . Additionally, ZTE unveiled a complete lineup of servers, storage, and cloud solutions tailored to both general and intelligent computing scenarios. This showcase reaffirmed ZTE","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180422DC7IYS","origin_url":"https://www.bangkokpost.com/thailand/pr/2904068/thailand-space-week-2024-pioneering-regional-space-ambitions","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/e813aea1-0e98-47e4-9788-cd20d0ca7ddb","title":"Thailand Space Week 2024: Pioneering Regional Space Ambitions","description":"Thailand Space Week 2024 (TSW2024)  , Southeast Asia’s premier space technology and innovation event, concluded with record-breaking success on 9 November 2024 at Impact Muang Thong Thani. Drawing over 4,500 attendees, the three-day event solidified Thailand’s aspirations to establish itself as a strategic space hub in the region.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null},{"code":"ART2411180252PTTBQT","origin_url":"https://www.bangkokpost.com/thailand/pr/2902851/sanofi-thailand-wins-fifth-consecutive-amcham-impact-award","site_code":"TH01","url":null,"image":"https://github.com/user-attachments/assets/95ffd91e-e7f0-4ba1-a2d4-44df9f77c362","title":"Sanofi Thailand Wins Fifth Consecutive AmCham Impact Award","description":"Sanofi, a leading global healthcare company, has received the “Corporate Social Impact Award 2024 – Gold level” for the fifth consecutive year from the American Chamber of Commerce in Thailand (AmCham Thailand), reaffirming its commitment to business practices rooted in social and community responsibility. The company continues to support initiatives that enhance the well-being of Thai society and promote sustainability. Representing Sanofi Thailand, Ms Mantana Tanprasert, Head of Vaccines for Thailand and Myanmar, and Mr Charles Trolliet, Head of Commercial Thailand, Pharma Business, proudly accepted the award at Avani+ Riverside Bangkok Hotel recently.","status":"FINISH_META","category_code":"PUBLIC_RELATIONS","language_code":"en","tags":null}],"prev":null,"next":"/th/en/24ARTENPUBLICRELATIONS0CDF83.json"}