{"data":[{"code":"ART2411190316JZTUAP","origin_url":"https://www.matichon.co.th/foreign/news_4905860","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/f6ed94d8-0165-468d-b64f-cfe5c615eff9","title":"ด่วน! ชายขับรถพุ่งชนคนนอกโรงเรียนประถมในจีน เด็กเจ็บเพียบ ตร.รวบคนขับแล้ว","description":"สำนักข่าวบีบีซีและเอเอฟพีรายงานว่า เกิดเหตุคนขับรถ SUV พุ่งชนฝูงชนนอกโรงเรียนประถมศึกษายงอาน ในเมืองฉางเต๋อ มณฑลหูหนาน ประเทศจีน เมื่อวันที่ 19 พฤศจิกายน ส่งผลให้มีเด็กนักเรียนได้รับบาดเจ็บหลายราย และทางการจีนกำลังอยู่ระหว่างตรวจสอบว่ามีผู้เสียชีวิตหรือไม่","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111902076BGEZ5","origin_url":"https://www.matichon.co.th/foreign/news_4905076","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-รายงาน-น.32.jpg","title":"วิเทศวิถี: มองมุมกลับ โอกาสของไทยในยุคทรัมป์ 2.0","description":"วันที่ 20 มกราคม 2025 จะเป็นวันแรกที่นายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐคนที่ 47 เข้ารับตำแหน่งประธานาธิบดีอย่างเป็นทางการหลังพิธีสาบานตนเสร็จสิ้น อย่างไรก็ดี การกลับมาของทรัมป์ในครั้งนี้ถึงกับเขย่าให้หลายภาคส่วนของสังคมเกิดความอกสั่นขวัญผวา ด้วยเหตุว่านโยบายอเมริกามาก่อนของเขาอาจจะทำให้ระเบียบโลกเกิดการสั่นนคลอน และเกิดความตึงเครียดในทางภูมิรัฐศาสตร์มากขึ้น","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411181017K6M3O4","origin_url":"https://www.matichon.co.th/foreign/news_4905189","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/bec1ff27-1537-48bc-a144-bd58d31595b1","title":"ไม่ย่อท้อ! ผัวใช้เวลาร้อยวัน ปั่นจักรยาน 4,400 กม. ตามง้อเมีย ขอโอกาส กลับมาคืนดีกัน","description":"ไม่ย่อท้อ! ผัวปั่นจักรยาน ปั่นจักรยาน 4,400 กม. ใช้เวลาร้อยวัน ตามง้อเมีย หลังรักๆ เลิกๆ แยกกันอยู่ นาน2 ปี ปักหมุดยุโรป หลังจากนี้","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111809027PA1SP","origin_url":"https://www.matichon.co.th/foreign/news_4905047","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AFP__20241117__36MN4MJ__v1__HighRes__VaticanReligionPopeMassPoverty.jpg","title":"โป๊ปฟรานซิสชี้ช่อง ศึกษาฆ่าล้างเผ่าพันธ์ในกาซา","description":"สำนักข่าวรอยเตอร์รายงานว่า สมเด็จพระสันตะปาปาฟรานซิสทรงแนะนำให้มีการศึกษาว่า การดำเนินการทางทหารของอิสราเอลในกาซาถือเป็นการฆ่าล้างเผ่าพันธ์ต่อชาวปาเลสไตน์หรือไม่ โดยข้อความนี้เป็นการวิจารณ์การกระทำของอิสราเอลอย่างชัดเจนที่สุดของสมเด็จพระสันตะปาปฟรานซิส ตั้งแต่สงครามเริ่มต้นขึ้น","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411180822RXMNF4","origin_url":"https://www.matichon.co.th/foreign/news_4904962","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/8232682d-ef53-49e7-b8e2-1def98700c9e","title":"มะกัน-ปินส์จับมือ แบ่งปันข่าวกรองทางทหาร กระชับสัมพันธ์ด้านกลาโหม","description":"สำนักข่าวรอยเตอร์รายงานว่า เมื่อวันที่ 18 พฤศจิกายน ประเทศฟิลิปปินส์และสหรัฐอเมริกาได้ลงนามข้อตกลง General Security of Military Information Agreement หรือ GSOMIA ที่จะทำให้ทั้งสองประเทศแบ่งปันข้อมูลข่าวกรองลับทางทหารระหว่างกันได้ เพื่อเป็นการกระชับความสัมพันธ์ด้านกลาโหม","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111807376UQC6P","origin_url":"https://www.matichon.co.th/foreign/news_4904848","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-8-AFP__20241118__36MQ28Y__v1__HighRes__IndiaEnvironmentPollution.jpg","title":"เดลีอ่วม! ค่ามลพิษขึ้นระดับรุนแรงขั้นสูงสุด หนักสุดในปีนี้  ","description":"เมื่อวันที่ 18 พฤศจิกายน หมอกควันที่หนาทึบและเป็นพิษปกคลุมพื้นที่ส่วนใหญ่ในทางตอนเหนือของอินเดีย อีกทั้ง ค่ามลพิษของอินเดียยังสูงสุดในปีนี้ในปริมาณ 484 ซึ่งอยู่ในระดับรุนแรงขั้นสูงสุดด้วย โดยหมอกควันที่เกิดขึ้นเป็นการผสมผสานกันอย่างเป็นพิษระหว่างควันและหมอก ซึ่งเกิดขึ้นทุกปีในฤดูหนาว ฝุ่นละออง สารพิษที่ถูกปล่อย รวมถึงควันจากการเผาป่าเถื่อนถูกกักรวมกันไว้เนื่องด้วยอากาศที่เย็นลง","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111806129SNJMK","origin_url":"https://www.matichon.co.th/foreign/news_4904578","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/ec3597ba-774f-426f-a91c-96914cf9e24d","title":"‘ไบเดน’ ท่องแอมะซอนก่อนประชุม G20 ถกผู้นำท้องถิ่นเรื่องอนุรักษ์ป่าฝน  ","description":"เมื่อวันที่ 17 พฤศจิกายน นายโจ ไบเดน ประธานาธิบดีสหรัฐเยือนป่าแอมะซอน และได้เน้นย้ำถึงความสำคัญในเรื่องการจัดการกับปัญหาการเปลี่ยนแปลงทางสภาพภูมิอากาศ ซึ่งมีแนวโน้มที่จะถูกเพิกเฉยในวาระที่นายโดนัลด์ ทรัมป์ ขึ้นมาดำรงตำแหน่งประธานาธิบดีสหรัฐคนต่อไป โดยในการนี้ทำให้ไบเดนเป็นประธานาธิบดีสหรัฐคนแรกที่เดินทางไปที่ป่าแอมะซอนอีกด้วย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411180436Y91Y6C","origin_url":"https://www.matichon.co.th/foreign/news_4904354","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/9c54c976-d39d-49e5-a7e0-1d46be3fb12b","title":"กูเตอร์เรสวอนผู้นำ G20 แก้ไขปัญหาโลกร้อน หลัง COP29 ไม่คืบ","description":"สำนักข่าวรอยเตอร์รายงานว่า ประเทศสมาชิก G20 เห็นชอบในข้อตกลงบางประการในการจัดการงบประมาณสนับสนุนเพื่อรับมือกับการเปลี่ยนแปลงทางสภาพภูมิอากาศ ทำให้เกิดการคาดการณ์ว่าการประชุมผู้นำ G20 ที่บราซิลในสัปดาห์นี้จะมีทิศทางที่ดี หลังจากในที่ประชุม COP29 ซึ่งจัดที่กรุงบากู อาเซอร์ไบจาน ประเทศผู้เข้าร่วมประชุมไม่สามารถบรรลุข้อตกลงดังกล่าวได้","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411180427ZVXSAR","origin_url":"https://www.matichon.co.th/foreign/news_4904322","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/34ed2c74-5ae3-4c1f-bdc5-9ac946c0b8b3","title":"จุดเปลี่ยนสงคราม! ไบเดนไฟเขียวยูเครนใช้ขีปนาวุธพิสัยไกลโจมตีรัสเซีย","description":"สำนัข่าวต่างประเทศรายงานว่าประธานาธิบดีโจ ไบเดน ของสหรัฐ อนุมัติให้ยูเครนใช้ขีปนาวุธพิสัยไกลที่สหรัฐจัดหาให้นำไปใช้โจมตีรัสเซียได้ ซึ่งถือเป็นการเปลี่ยนแปลงด้านนโยบายครั้งใหญ่ ที่สื่อตะวันตกระบุว่าเป็นท่าทีที่กล้าหาญในช่วงหลายเดือนสุดท้ายก่อนที่จะส่งมอบอำนาจในการบริหารให้กับนายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐคนใหม่ในเดือนมกราคมปีหน้า","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411180416H5AX0F","origin_url":"https://www.matichon.co.th/foreign/news_4904282","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/03ce01c6-4394-4a35-903c-de70297da289","title":"อิสราเอลถล่มเบรุต เด็ดหัวหน.ฝ่ายสื่อฮิซบอลเลาะห์","description":"สำนักข่าวรอยเตอร์ เอเอฟพีและบีบีซีรายงานว่า กลุ่มฮิซบอลเลาะห์ในประเทศเลบานอนได้ออกมายืนยันว่า นายโมฮัมเหม็ด อาฟิฟ หัวหน้าฝ่ายสื่อของกลุ่มฮิซบอลเลาะห์ เสียชีวิตจากการโจมตีทางอากาศของกองทัพอิสราเอลใส่อาคารแห่งหนึ่งในเขตราส อัล-นาบาของกรุงเบรุต เมืองหลวงของประเทศเลบานอน เมื่อวันที่ 17 พฤศจิกายน ส่งผลให้มีผู้เสียชีวิต 4 ราย และมีผู้บาดเจ็บ 14 ราย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111710472R309C","origin_url":"https://www.matichon.co.th/foreign/news_4903690","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/c038cf43-363d-4ceb-987b-248ee5ca7e18","title":"ซุปเปอร์ไต้ฝุ่นหม่านหยี่พัดถล่มเกาะลูซอนของฟิลิปปินส์ อุตุฯ เตือนน้ำท่วม-ดินถล่ม","description":"สำนักข่าวเอเอฟพีรายงานว่า ซุปเปอร์ไต้ฝุ่นหม่านหยี่ได้พัดถล่มเกาะลูซอน ซึ่งเป็นเกาะที่มีประชากรมากที่สุดของประเทศฟิลิปปินส์ เมื่อวันที่ 17 พฤศจิกายน โดยกรมอุตุนิยมวิทยาของประเทศได้เตือนถึงโอกาสที่จะเกิดน้ำท่วม ดินถล่ม และคลื่นสูง","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411171006YUFDB6","origin_url":"https://www.matichon.co.th/foreign/news_4903556","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AP24321658476826-1200.jpg","title":"ผงะ! สหรัฐพบผู้ป่วยฝีดาษลิงสายพันธุ์ใหม่รายแรก พบประวัติเดินทางแอฟริกา","description":"สำนักข่าวบีบีซีและเอพีรายงานว่า ทางการสหรัฐรายงานการพบผู้ป่วยโรคฝีดาษลิง สายพันธุ์เคลด 1 เป็นรายแรกของสหรัฐที่รัฐแคลิฟอร์เนีย เมื่อวันที่ 16 พฤศจิกายนที่ผ่านมา ซึ่งเป็นสายพันธุ์เดียวกับที่มีการแพร่ระบาดครั้งใหญ่ในหลายประเทศเมื่อเร็วๆ นี้หลังตรวจพบครั้งแรกที่ประเทศคองโก และเป็นคนละสายพันธุ์กับที่มีการแพร่ระบาดอยู่ในหลายประเทศรวมถึงสหรัฐอเมริกาตั้งแต่ปี 2022","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111709070DZ7B8","origin_url":"https://www.matichon.co.th/foreign/news_4903497","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/f14a472b-b84b-49cc-8d77-d9d86d4cce52","title":"ไทยเจ้าภาพ อบรมกม.ระหว่างประเทศระดับภูมิภาค UN มุ่งพัฒนาความรู้ด้านกฎหมาย  ","description":"กระทรวงการต่างประเทศระบุว่า ประเทศไทยจะเป็นเจ้าภาพการฝึกอบรมหลักสูตรกฎหมายระหว่างประเทศระดับภูมิภาคของสหประชาชาติ (United Nations Regional Course in International Law: UN Regional Course) ประจำปี 2567 ระหว่างวันที่ 18 พฤศจิกายน – 11 ธันวาคม ที่กรุงเทพมหานคร เพื่อเปิดโอกาสให้นักกฎหมายโดยเฉพาะเจ้าหน้าที่ภาครัฐและนักวิชาการจากประเทศกำลังพัฒนาได้พัฒนาความรู้ความเข้าใจในกฎหมายระหว่างประเทศเพื่อนำไปปรับใช้ได้อย่างมีประสิทธิภาพ","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411170807JP7CLC","origin_url":"https://www.matichon.co.th/foreign/news_4903311","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/795021d9-7653-4eb3-98dc-1eea5283f147","title":"สุดเศร้า แพนด้าแดง ตกใจเสียงพลุงานฉลอง เกิดภาวะเครียด จนตายในวัยเพียง 3 เดือน","description":"เจ้าหน้าที่สวนสัตว์สกอตแลนด์ แจ้งข่าวเศร้า แพนด้าแดง วัยเพียง 3 เดือน ตกใจเสียงพลุ งานฉลอง Bonfire Night สุดท้ายเกิดภาวะเครียด จนตาย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24111707125Q6ILE","origin_url":"https://www.matichon.co.th/foreign/news_4903214","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/cc94111d-debc-4a6c-ac31-1fbe01419bb7","title":"‘เซเลนสกี’ มั่นใจ สงครามยูเครนจบเร็วขึ้น หลัง ‘ทรัมป์’ นั่งปธน.มะกัน","description":"สำนักข่าวบีบีซีและรอยเตอร์รายงานว่า ประธานาธิบดีโวโลดิมีร์ เซเลนสกีของยูเครนกล่าวว่าสงครามยูเครนอาจสิ้นสุดลงไวขึ้นเมื่อนายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐขึ้นดำรงตำแหน่งเป็นผู้นำสหรัฐคนใหม่ โดยบอกว่ายูเครนจะต้องทำทุกอย่างเพื่อให้แน่ใจว่าสงครามยูเครนจะสิ้นสุดลงในปีหน้า","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411170517591KXZ","origin_url":"https://www.matichon.co.th/foreign/news_4902987","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/612ff204-d354-48fa-8fd1-ac055fb356a2","title":"‘ไบเดน’ คุย ‘สี’ ครั้งสุดท้ายก่อนอำลาตำแหน่งปธน.สหรัฐ ผู้นำจีนลั่นพร้อมร่วมงานกับ ‘ทรัมป์’","description":"สำนักข่าวเอเอฟพีและรอยเตอร์รายงานว่า ประธานาธิบดีสี จิ้นผิงของจีนได้พบกับประธานาธิบดีโจ ไบเดนของสหรัฐ ในการประชุมผู้นำเขตเศรษฐกิจเอเปค ครั้งที่ 31 ที่กรุงลิมา ประเทศเปรู เมื่อวันที่ 16 พฤศจิกายน ตามเวลาท้องถิ่น โดยถือเป็นการพบหารือกันระหว่างประธานาธิบดีสีและประธานาธิบดีไบเดนเป็นครั้งสุดท้าย หลังไบเดนจะลงจากตำแหน่งผู้นำสหรัฐในเดือนมกราคมที่จะถึงนี้","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411170332FEA7JD","origin_url":"https://www.matichon.co.th/foreign/news_4902809","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/b1541330-5949-404e-b76a-82cd9268f42b","title":"หนุ่มจีนไล่แทงคนนอกวิทยาลัยเทคนิค ดับ 8 เจ็บ 17 ตร.เผยเป็นศิษย์เก่า แค้นไม่ได้วุติบัตรเพราะสอบตก","description":"สำนักข่าวบีบีซีและรอยเตอร์รายงานว่า เกิดเหตุชายชาวจีนคนหนึ่งไล่แทงคนที่บริเวณด้านนอกวิทยาลัยเทคนิคและอาชีวศึกษาด้านงานฝีมือและศิลปะอู๋ซีอี้ซิง (Wuxi Yixing Arts and Crafts Vocational and Technical College) ในเมืองอู๋ชี มณฑลเจียงซู ประเทศจีน เมื่อวันที่ 16 พฤศจิกายน ส่งผลให้มีผู้เสียชีวิต 8 ราย บาดเจ็บ 17 ราย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411170212QK5XJC","origin_url":"https://www.matichon.co.th/foreign/news_4902499","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AP24308691421721.jpg","title":"โฟกัสโลกรอบสัปดาห์: เมื่อพรรคเดโมแครตแพ้ภัยตัวเอง","description":"หลังจากผลการเลือกตั้งสหรัฐปี 2024 เผยออกมาว่านายโดนัลด์ ทรัมป์หวนคืนสู่เก้าอี้ประธานาธิบดีสหรัฐอีกครั้ง สื่อไทยและเทศพากันโหมตีข่าวถึงสาเหตุว่าทำไมพรรคเดโมแครตถึงแพ้การเลือกตั้งในครั้งนี้ ทั้งๆ ที่ผลโพลและนักวิชาการหลายสำนักต่างชี้ว่า นางคามาลา แฮร์ริส นี่แหละที่จะเป็นประธานาธิบดีหญิงผิวสีเชื้อสายเอเชียคนแรกของสหรัฐ ทั้งนี้ สาเหตุที่ทำให้พรรคเดโมแครตสูญเสียอำนาจในการบริหารประเทศ สามารถตอบได้ง่ายๆ เลยว่า เป็นเพราะพรรคลาน้ำเงินวิ่งสะดุดขาตัวเองล้ม ความเป็นเดโมแครตเองนั่นแหละที่ทำให้พรรคเดโมแครตพ่ายแพ้ในการเลือกตั้งในครั้งนี้ ","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411160946O05664","origin_url":"https://www.matichon.co.th/foreign/news_4902216","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/Screenshot-2024-11-16-163201-1.png","title":"ระทึก! เที่ยวบินโดยสาร เซาท์เวสต์แอร์ไลน์ โดนยิงขณะจะขึ้นบิน โชคดีไร้เจ็บ ตร.ยังมึนฝีมือใคร","description":"องค์การบริหารการบินแห่งสหรัฐอเมริกา(เอฟเอเอ) เปิดเผยว่า เครื่องบินโดยสารเที่ยวบินที่ 2494 ของสายการบินเซาท์เวสต์แอร์ไลน์ ถูกกระสุนปืนยิงเข้าใส่ขณะเครื่องกำลังจะทะยานออกจากสนามบินดัลลาส เลิฟฟิลด์ ในเมืองดัลลาส รัฐเท็กซัส ประเทศสหรัฐ เพื่อมุ่งหน้าไปยังเมืองอินเดียแนโพลิส ในรัฐอินดีแอนา เหตุเกิดเมื่อเวลาประมาณ 20.30 น.ของวันที่ 15 พฤศจิกายนที่ผ่านมาตามเวลาท้องถิ่น","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411160747PZNEY0","origin_url":"https://www.matichon.co.th/foreign/news_4902022","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/e0bfa041-ff6d-4e8b-956b-c5b23f0ad66d","title":"จับตา 'ไบเดน' พบหน้าจ้อ 'สี' ครั้งสุดท้าย ก่อนอำลาเก้าอี้ปธน.มะกัน","description":"เมื่อวันที่ 16 พฤศจิกายน สำนักข่าวเอเอฟพีรายงานว่า ประธานาธิบดีโจ ไบเดน ของสหรัฐอเมริกา มีกำหนดจะพบหารือทวิภาคีกับประธานาธิบดีสี จิ้นผิง ของจีนนอกรอบในระหว่างร่วมการประชุมสุดยอดผู้นำกรอบความร่วมมือทางเศรษฐกิจในภูมิภาคเอเชีย-แปซิฟิก (เอเปค) ที่กรุงลิมา ประเทศเปรู ในวันเสาร์(16 พ.ย.)นี้ตามเวลาท้องถิ่น ซึ่งจะเป็นการพบปะพูดคุยกันระหว่างผู้นำชาติมหาอำนาจทั้งสองรายนี้เป็นครั้งสุดท้าย ก่อนที่ประธานาธิบดีไบเดนจะลงจากตำแหน่งและนายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐจะก้าวขึ้นครองทำเนียบขาวอีกครั้งในเดือนมกราคมปีหน้า ","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART241116074754MVJC","origin_url":"https://www.matichon.co.th/foreign/news_4902024","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/7dc92772-8cf6-4579-ab0e-f77646a0bbb1","title":"อวดรวยจนงานเข้า! หนุ่มโดนตร.สอบ อ้างรวยเป็นหมื่นล้าน ยายให้ของขวัญวันเกิด 870 ล้าน","description":"อวดรวยจนงานเข้า! หนุ่มถูกจับ อ้างรวยเป็นหมื่นล้าน ยายให้ของขวัญวันเกิด 870 ล้าน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null}],"prev":null,"next":"/th/th/24ARTTHWORLDOTUW53.json"}