{"data":[{"code":"ART2411260808K97CV2","origin_url":"https://www.matichon.co.th/foreign/news_4920803","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1220000000000.jpg","title":"ศาลยกฟ้องทรัมป์คดีล้มผลเลือกตั้งปี 2020","description":"เมื่อวันที่ 25 พฤศจิกายน ศาลสหรัฐยกฟ้องคดีที่นายโดนัลด์ ทรัมป์ ประธานาธิบดีสหรัฐคนที่ 45 และว่าที่ประธานาธิบดีคนที่ 47 ในการล้มผลการเลือกตั้งปี 2020 โดยคำพิพากษาของผู้พิพากษาทันย่า ชัตคาน ได้ยุติความพยายามของรัฐบาลกลางในการดำเนินคดีทางอาญากับทรัมป์ในข้อหาที่เขาพยายามรักษาอำนาจ แม้ว่าเขาจะแพ้การเลือกตั้งในปี 2020 ซึ่งนำไปสู่เหตุการณ์ความรุนแรงโจมตีรัฐสภาสหรัฐเมื่อวันที่ 6 มกราคม 2021","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411260646S3Y8U9","origin_url":"https://www.matichon.co.th/foreign/news_4920578","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/2024-11-25T085853Z_1427049284_RC27ABAE6J20_RTRMADP_3_NORTHKOREA-MILITARY-MISSILES-1.jpg","title":"ภาพดาวเทียมชี้ โสมเหนือขยายรง.ผลิตขีปนาวุธ KN-23 ส่งป้อนรัสเซียใช้ถล่มยูเครน","description":"สำนักข่าวรอยเตอร์รายงานเมื่อวันที่ 25 พฤศจิกายน อ้างการเปิดเผยของคณะนักวิจัยประจำศูนย์เจมส์มาร์ตินเพื่อการศึกษาการไม่แพร่ขยายอาวุธ(CNS)และการวิเคราะห์ภาพถ่ายดาวเทียมเผยให้เห็นว่าเกาหลีเหนือกำลังขยายโรงงานผลิตอาวุธซึ่งเป็นแหล่งประกอบขีปนาวุธพิสัยใกล้ KN-23 ในการส่งป้อนให้กับรัสเซียเพื่อนำไปใช้ในการโจมตียูเครน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411260418QT0KKV","origin_url":"https://www.matichon.co.th/foreign/news_4920496","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AP24330477239006-1200.jpg","title":"‘อิสราเอล-ฮิซบอลเลาะห์’ ใกล้ปิดดีลหยุดยิง ครม.ยิวจ่อประชุมค่ำนี้","description":"สำนักข่าวเอเอฟพีรายงานว่า คณะรัฐมนตรีความมั่นคงของอิสราเอลจะมีการหารือกันในค่ำวันที่ 26 พฤศจิกายน ตามเวลาท้องถิ่น เพื่อพิจารณาว่าจะยอมรับข้อตกลงหยุดยิงกับกลุ่มฮิซบอลเลาะห์ในประเทศเลบานอนหรือไม่ โดยเจ้าหน้าที่ทำเนียบขาวของสหรัฐเชื่อว่าทั้งสองฝ่ายใกล้จะบรรลุข้อตกลงหยุดยิงแล้ว","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411260327VV7VP6","origin_url":"https://www.matichon.co.th/foreign/news_4920408","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/7af4ba2d-774d-463f-bbac-b68d12f3e62e","title":"เอาจริง! ‘ทรัมป์’ ประกาศขึ้นภาษีนำเข้า ‘แคนาดา-แม็กซิโก’ 25% บีบแก้ปัญหายาเสพติด-ผู้อพยพ จีนเจอเพิ่ม 10%","description":"เมื่อวันที่ 25 พฤศจิกายน นายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐคนที่ 47 ที่จะเข้ารับตำแหน่งอย่างเป็นทางการในวันที่ 20 มกราคม 2025 ประกาศว่าจะขึ้นภาษีนำเข้าประเทศคู่ค้าสำคัญของสหรัฐ 3 ประเทศ ได้แก่ แคนาดา แม็กซิโกและจีน ตามนโยบายอเมริกามาก่อนที่เขาได้รณรงค์หาเสียงไว้ โดยจะขึ้นภาษีนำเข้าสินค้าจากแคนาดาและแม็กซิโก 25% จนกว่าจะเกิดการจัดการกับปัญหายาเสพติดโดยเฉพาะเฟนทานิล รวมถึงปัญหาผู้อพยพที่ข้ามชายแดนมาที่สหรัฐ กระนั้นก็ดี มาตรการเช่นนี้อาจจะส่งผลกระทบต่อข้อตกลงการค้าเสรีของภูมิภาคที่ทรัมป์ผ่านร่างเป็นกฎหมายไว้เมื่อปี 2020","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411251221J2R767","origin_url":"https://www.matichon.co.th/foreign/news_4920001","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/45410.jpg","title":"หนุ่มสูญ 2.4 หมื่นล้านบาท หลังทิ้งฮาร์ดไดรฟ์ ที่บรรจุบิทคอยน์ไป ลุ้นขอค้นขยะประจำเมือง","description":"หนุ่มสูญ 2.4 หมื่นล้านบาท หลังทิ้งฮาร์ดไดรฟ์ ที่บรรจุบิทคอยน์ ร้องขอค้นขยะประจำเมือง","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411251151DD78SU","origin_url":"https://www.matichon.co.th/foreign/news_4919974","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AFP__20241102__36LD2H6__v3__HighRes__IranIsraelPalestinianLebanonConflict-2.jpg","title":"ผู้นำสูงสุดอิหร่าน ชี้ศาลอาญาโลก แค่ออกหมายจับผู้นำอิสราเอลไม่พอ ต้องสั่งประหาร","description":"สำนักข่าวรอยเตอร์รายงานว่า อยาตอลเลาะห์ อาลี คาเมเนอี ผู้นำสูงสุดของอิหร่าน กล่าวให้ความเห็นในวันจันทร์(25 พ.ย.) ถึงกรณีที่ศาลอาญาระหว่างประเทศ(ไอซีซี) ตัดสินใจออกหมายจับนายเบนจามิน เนทันยาฮู นายกรัฐมนตรีอิสราเอล และนายโยอาฟ กัลแลนต์ เมื่อปลายสัปดาห์ก่อน ในข้อหาก่ออาชญากรรมสงครามจากการทำสงครามโจมตีในฉนวนกาซาว่า เหล่าผู้นำอิสราเอลควรถูกสั่งโทษประหารชีวิต ไม่ใช่แค่การออกหมายจับ","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411251027K8MYY7","origin_url":"https://www.matichon.co.th/foreign/news_4919756","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AFP__20241125__36N37N8__v1__HighRes__FilesPhilippinesPoliticsMarcosDuterte-1.jpg","title":"ปธน.ปินส์กร้าว! ลั่นจะสู้กลับ หลังโดนรองปธน.คู่หู สั่งแผนลอบสังหาร","description":"เมื่อวันที่ 25 พฤศจิกายน สำนักข่าวรอยเตอร์รายงานว่า ประธานาธิบดีเฟอร์ดินานด์ มาร์กอส จูเนียร์ ของฟิลิปปินส์ ให้คำมั่นอย่างแข็งกร้าวว่าจะต่อสู้กับการข่มขู่คุกคามที่มีต่อเขา ซึ่งเป็นท่าทีหลังจากเมื่อไม่กี่วันก่อนนางซาราห์ ดูแตร์เต รองประธานาธิบดีฟิลิปปินส์ ออกมากล่าวว่าเธอได้สั่งการให้ลอบสังหารประธานาธิบดีมาร์กอส ภรรยาของเขา และประธานสภาผู้แทนราษฎร หากเธอถูกสังหารเสียชีวิตก่อน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411251002WT5105","origin_url":"https://www.matichon.co.th/foreign/news_4918960","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/เอกสาร-ร.4-1200_0.jpg","title":"เปิดบันทึก เตช บุนนาค ตามหาเอกสาร ร.4 ส่งทูตไทยในปารีส ยังหวังไม่โดนไฟไหม้ปี 2503","description":"เปิดบันทึก เตช บุนนาค ตามหาต้นฉบับสมุดไทยดำ เอกสาร ร.4 ส่งทูตไทยในปารีส ยังหวังไม่ถูกไฟไหม้วอดปี 64 ปีก่อน วิงวอนหอสมุดแห่งชาติเพียรค้นต่อ ยัน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250856ZWH0UR","origin_url":"https://www.matichon.co.th/foreign/news_4919551","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-307.jpg","title":"โคลนถล่มโบลิเวีย พัดคนหาย 1 ราย เสียหายหลายครัวเรือน","description":"สำนักข่าวเอพีรายงานว่า เมื่อวันที่ 24 พฤศจิกายน ได้เกิดเหตุการณ์ดินถล่มที่เกิดจากฝนตกหนักหลังการประสบภัยแล้งมาเป็นเวลานานที่เมืองลาเปซ เมืองหลวงของประเทศโบลิเวีย ทำให้ดินและโคลนเข้าท่วมบ้านเรือนหลายหลังคาเรือน ส่งผลให้เด็กหญิงสูญหาย 1 รายและไฟฟ้าไม่สามารถใช้การได้ โดยในขณะนี้ทางการได้อพยพประชากรในพื้นที่แล้ว","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250851W9894H","origin_url":"https://www.matichon.co.th/foreign/news_4919503","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/9e815ef7-5350-4e29-9d21-5872b68a13d7","title":"ระทึก! ไฟลุกบินโดยสารรัสเซีย หลังลงจอดที่ตุรกี อพยพวุ่นผู้โดยสาร-ลูกเรือ เกือบร้อยชีวิต (คลิป)","description":"สำนักข่าวรอยเตอร์และเอพีรายงานว่า เมื่อวันที่ 24 พฤศจิกายน เกิดเหตุการณ์ระทึกขวัญขึ้นเมื่อเครื่องยนต์ของเครื่องบินโดยสารรัสเซียที่บรรทุกผู้โดยสารมา 95 คน เกิดไฟลุกไหม้ขึ้น หลังจากเครื่องบินกำลังลงจอดที่ท่าอากาศยานอันตัลยา ทางตอนใต้ของประเทศตุรกี แต่โชคดีโดยผู้โดยสารและลูกเรือทั้งหมดได้ถูกช่วยเหลือและอพยพออกมาได้อย่างปลอดภัย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250827M2HWBZ","origin_url":"https://www.matichon.co.th/foreign/news_4919439","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/5237582.jpg","title":"ศาลเกาหลีใต้ สั่งจำคุกหนุ่มวัย 26 ขุนตัวเองให้อ้วนหนีเกณฑ์ทหาร เพื่อนเจ้าของไอเดียโดนด้วย","description":"ศาลเกาหลีใต้ สั่งจำคุกหนุ่มวัย 26 ขุนตัวเองให้อ้วนหนีทหาร เพื่อนคนแนะนำโดนด้วย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250556Q0T2DT","origin_url":"https://www.matichon.co.th/foreign/news_4919060","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AFP__20241124__36N78JR__v1__HighRes__TaiwanPoliticsKmt.jpg","title":"ไต้หวันเจอบอลลูนจีนป่วนครั้งแรกในรอบ 6 เดือน","description":"กระทรวงกลาโหมของไต้หวันแถลงเมื่อวันที่ 25 พฤศจิกายนว่า ได้พบบอลลูนจากจีนลอยอยู่บริเวณที่ห่างท่าเรือจีหลงในระยะทาง 111 กิโลเมตร ที่ทางตอนเหนือของไต้หวันเมื่อเวลา 18.21 น. ของวันที่ 24 พฤศจิกายน ตามเวลาท้องถิ่น ซึ่งนับเป็นครั้งแรกตั้งแต่เดือนเมษายน โดยแคมเปญปล่อยบอลลูนของจีนนั้น เป็นยุทธวิถีที่ไม่ใช่การปะทะกันต่อหน้าเพื่อสร้างแรงกดดันและความไม่สบายใจให้กับไต้หวัน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24112504572PHI3I","origin_url":"https://www.matichon.co.th/foreign/news_4918845","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AFP__20241124__36N9848__v2__HighRes__TopshotLebanonIsraelPalestinianConflict-1.jpg","title":"แลกกันเดือด! ฮิซบอลเลาะห์ รัวจรวดหลายร้อยลูก โจมตีเทลอาวีฟ ตอบโต้อิสราเอลถล่มเบรุตดุ ดับ 29","description":"สำนักข่าวรอยเตอร์รายงานว่า กลุ่มฮิซบอลเลาะห์ ในเลบานอน ระดมยิงจรวดโจมตีใกล้กับนครเทลอาวีฟของอิสราเอล เมื่อวันอาทิตย์ที่ 24 พฤศจิกายนตามเวลาท้องถิ่น ส่งผลให้บ้านเรือนในพื้นที่ดังกล่าวได้รับความเสียหายหรือเกิดไฟลุกไหม้ขึ้น การโจมตีดังกล่าวมีขึ้นหลังจากกองทัพอิสราเอลได้โจมตีทางอากาศถล่มใส่กรุงเบรุต เมืองหลวงของเลบานอน ในวันก่อนหน้าที่มุ่งกำจัดกลุ่มแกนนำฮิซบอลเลาะห์ที่ยังเคลื่อนไหวอยู่ ซึ่งเป็นผลให้มีผู้เสียชีวิตอย่างน้อย 29 ราย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250421XQUNQG","origin_url":"https://www.matichon.co.th/foreign/news_4918871","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AP24329369948793.jpg","title":"ยูเครนศึกษาซากขีปนาวุธหมีขาวรุ่นใหม่ ‘โอเรชนิค’ จากการโจมตีดนีโปร  ","description":"ยูเครนกำลังศึกษาเศษซากขีปนาวุธพิสัยกลางรุ่นใหม่ของรัสเซียที่มีชื่อเรียกว่า โอเรชนิคที่แปลว่าต้นฮาเซล ซึ่งเหลือจากการโจมตีเมืองดนีโปรเมื่อวันที่ 21 พฤศจิกายนที่ผ่านมา ซึ่งเป็นครั้งแรกที่อาวุธประเภทนี้ถูกใช้ตั้งแต่ที่สงครามระหว่างรัสเซียและยูเครนเริ่มต้นขึ้น","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411250336IEHIN0","origin_url":"https://www.matichon.co.th/foreign/news_4918821","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AFP__20241117__36MQ2ZT__v1__HighRes__UaeAstronomyMoon.jpg","title":"UAE รวบผู้ต้องสงสัย 3 รายเอี่ยวคดีฆาตกรรมแรบไบยิว โยงอิหร่านเกี่ยว - มะกันกร้าวร่วมประนาม","description":"เมื่อวันที่ 24 พฤศจิกายน กระทรวงมหาดไทยของสหรัฐอาหรับเอมิเรตส์แถลงว่า ทางการได้จับกุมตัวผู้ต้องสงสัย 3 รายที่เกี่ยวข้องกับคดีฆาตกรรมนายซวี โคกัน แรบไบ ครูสอนศาสนายูดาห์ชาวอิสราเอล วัย 28 ปี หลังจากที่เขาหายตัวไปเมื่อวันที่ 21 พฤศจิกายน พร้อมทั้งเน้นย้ำว่าหลักนิติบัญญัติจะถูกนำมาใช้โดยจะไม่ผ่อนปรนต่อการกระทำใดๆ ที่เป็นการทำให้ความมั่นคงทางสังคมของประเทศนั้นสั่นคลอน","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411241232AWB427","origin_url":"https://www.matichon.co.th/foreign/news_4917464","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/55-81.jpg","title":"ระทึก! เพลิงไหม้ครั้งใหญ่ ชุมชนแออัด มะนิลา เผาวอดบ้านประชาชนกว่า 1,000 หลัง","description":"ระทึก! เพลิงไหม้ครั้งใหญ่ ชุมชนแออัด มะนิลา เผาวอดบ้านประชาชนกว่า 1,000 หลัง","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411241023SKG9PE","origin_url":"https://www.matichon.co.th/foreign/news_4917270","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/91431d4a-c137-480a-acaa-d907ca1a624e","title":"ชาวอิสราเอลหายตัวปริศนา ถูกพบเป็นศพใน UAE เนทันยาฮูออกประนามก่อการร้ายต่อต้านชาวยิว","description":"เมื่อวันที่ 24 พฤศจิกายน นายเบนจามิน เนทันยาฮู นายกรัฐมนตรีอิสราเอล แถลงว่านายซวี โคกัน ชายชาวอิสราเอลที่เป็นผู้สอนศาสนายูดาห์และเป็นสมาชิกของกลุ่มยิวออร์โธดอกซ์ที่ใช้ชื่อว่า ชาบัด รวมถึงยังถือสัญชาติมอลโดวา ซึ่งหายตัวไปอย่างเป็นปริศนาที่ดูไบ สหรัฐอาหรับเอมิเรตส์ (UAE) เมื่อวันที่ 21 พฤศจิกายนที่ผ่านมา ถูกพบเป็นศพจากการฆาตกรรม พร้อมกับประนามว่าการเสียชีวิตของชายผู้นี้เป็นการกระทำที่เป็นการก่อการร้ายและเป็นการต่อต้านชาวยิวอย่างโหดร้าย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411240932RJWJ8U","origin_url":"https://www.matichon.co.th/foreign/news_4917166","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-Reuters.png","title":"ด่วน! เกิดเหตุยิงใกล้สถานทูตอิสราเอลในจอร์แดน รมต.ลั่นเป็นการก่อการร้าย  ","description":"เมื่อช่วงเช้ามืดของวันที่ 24 พฤศจิกายนตามเวลาท้องถิ่น เกิดเหตุชายรายหนึ่งยิงปืนที่ไปที่ตำรวจที่กำลังลาดตระเวนในย่านราเบีย ซึ่งเป็นย่านคนรวยในกรุงอัมมาน เมืองหลวงของจอร์แดน ใกล้กับสถานทูตอิสราเอล ส่งผลให้มีเจ้าหน้าที่ตำรวจบาดเจ็บ 3 ราย และหลังจากที่คนร้ายได้ก่อเหตุนั้น เขาถูกไล่ตามเป็นเวลานานมากกว่า 1 ชั่วโมง ก่อนที่จะจนมุมและถูกเจ้าหน้าที่ตำรวจวิสามัญเมื่อช่วงก่อนรุ่งสาง","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411240648SBV74I","origin_url":"https://www.matichon.co.th/foreign/news_4916851","site_code":"TH04","url":null,"image":"https://github.com/user-attachments/assets/831e5d1f-9454-47c0-ae38-f88dd9937439","title":"ทรัมป์ถกเลขาธิการนาโต ปมความมั่นคงโลกกระทบชาติพันธมิตร","description":"สำนักข่าวเอพีรายงานแถลงการณ์ขององค์การสนธิสัญญาป้องกันแอตแลนติกเหนือ (นาโต) ว่า นายโดนัลด์ ทรัมป์ ว่าที่ประธานาธิบดีสหรัฐคนที่ 47 พบหารือกับนายมาร์ก รุตต์ เลขาธิการนาโตในเรื่องความมั่นคงโลก เมื่อวันที่ 22 พฤศจิกายนที่ปาล์มบีช รัฐฟลอริดา","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411240608ZPNEAF","origin_url":"https://www.matichon.co.th/foreign/news_4916767","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-AFP__20241123__36N73K4__v1__HighRes__PalestinianIsraelConflictReligion.jpg","title":"ทรัมป์คัมแบ๊ก จุดความหวังยิว คุมเวสต์แบงก์ทั้งหมด","description":"สำนักข่าวรอยเตอร์รายงานว่า การยึดครองพื้นที่ของชาวอิสราเอลที่เพิ่มมากขึ้นในเขตเวสต์แบงก์และการกลับมานั่งเก้าอี้ประธานาธิบดีสหรัฐครั้งที่ 2 ของนายโดนัลด์ ทรัมป์ สร้างความหวังให้แก่ชาวอิสราเอลที่สนับสนุนการตั้งถิ่นฐานในเขตเวสต์แบงก์ว่า อิสราเอลจะสามารถมีอำนาจอธิปไตยเหนือพื้นที่ดังกล่าว ซึ่งชาวปาเลสไตน์มองว่าเป็นหัวใจสำคัญของรัฐในอนาคตของพวกเขาได้","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411240608D8PZSI","origin_url":"https://www.matichon.co.th/foreign/news_4916760","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/AP-cnn2.jpg","title":"สื่อโลกระส่ำ เอพี-ซีเอ็นเอ็น สำนักข่าวใหญ่จากมะกัน ปลดพนักงานหลายร้อย","description":"สื่อโลกระส่ำ เอพี-ซีเอ็นเอ็น สำนักข่าวใหญ่จากมะกัน ปลดพนักงานหลายร้อย","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART2411240447M2HW84","origin_url":"https://www.matichon.co.th/foreign/news_4916670","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-COP.jpg","title":"ประเทศโลกใต้โวย งบหนุนแก้ไขโลกร้อน 3 แสนล้านดอลลาร์ต่อปี ไม่พอ","description":"เมื่อวันที่ 24 พฤศจิกายน ณ ที่ประชุมรัฐภาคีกรอบอนุสัญญาสหประชาชาติว่าด้วยการเปลี่ยนแปลงสภาพภูมิอากาศสมัยที่ 29 (COP29) จัดขึ้นที่กรุงบากู อาเซอร์ไบจาน ประเทศที่เข้าร่วมประชุมดังกล่าวบรรลุข้อตกลงการจัดหาเงินสนับสนุนการแก้ไขปัญหาเรื่องการเปลี่ยนแปลงทางสภาพภูมิอากาศแก่ประเทศกำลังพัฒนามูลค่า 300,000 ล้านดอลลาร์สหรัฐต่อปีจนถึงปี 2035 ซึ่งเป็นจำนวนที่มากกว่าข้อตกลงเดิมที่มีมูลค่า 100,000 ล้านดอลลาร์สหรัฐที่บรรลุเมื่อปี 2022 แต่กำลังจะหมดอายุในปี 2025  ","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null},{"code":"ART24112403323PI42R","origin_url":"https://www.matichon.co.th/foreign/news_4916591","site_code":"TH04","url":null,"image":"https://www.matichon.co.th/wp-content/uploads/2024/11/1200-290.jpg","title":"อียูร้าว ฮังการีเมินหมายศาลโลก เชิญเนทันฮายูเยือนประเทศ","description":"นายโจเซฟ บอเรลล์ หัวหน้าฝ่ายทูตของสหภาพยุโรปกล่าวเมื่อวันที่ 23 พฤศจิกายน ที่กิจกรรมเวิร์กช็อประหว่างกลุ่มเคลื่อนไหวเพื่อสันติภาพชาวอิสราเอลและปาเลสไตน์ จัดที่ไซปรัส ว่า รัฐบาลของสมาชิกสหภาพยุโรปไม่สามารถมีมติเป็นเอกฉันท์ว่าจะดำเนินการจับกุมตัวนายเบนจามิน เนทันฮายู นายกรัฐมนตรี และนายโยอาฟ กัลแลนต์ อดีตรัฐมนตรีกระทรวงกลาโหมของอิสราเอล รวมถึงนายอัล มาสรี ผู้บัญชาการทางทหารของกลุ่มฮามาสหรือไม่ หลังจากที่ศาลอาญาระหว่างประเทศ (ICC) ประกาศออกหมายจับบุคคลข้างต้นเมื่อวันที่ 21 พฤศจิกายนที่ผ่านมา เนื่องในข้อหาการก่ออาชญกรรมต่อมนุษยชาติ อย่างไรก็ตาม สมาชิกสหภาพยุโรปมีพันธะที่จะต้องปฏิบัติตามธรรมนูญกรุงโรม ที่เป็นสนธิสัญญาที่ตนได้ลงนามไว้","status":"FINISH_META","category_code":"WORLD","language_code":"th","tags":null}],"prev":null,"next":"/th/th/24ARTTHWORLDWDZHBW.json"}